MikroElektronika/core_packages/PIC/XC8/def/PIC16F1786/mcu.h
// Register: PSMC1PHS
#define PSMC1PHS PSMC1PHS
extern volatile unsigned char           PSMC1PHS            __at(0x81A);
#ifndef _LIB_BUILD
asm("PSMC1PHS equ 081Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1PHST                 :1;
        unsigned P1PHSC1                :1;
        unsigned P1PHSC2                :1;
        unsigned P1PHSC3                :1;
        unsigned P1PHSC4                :1;
        unsigned                        :2;
        unsigned P1PHSIN                :1;
    };
} PSMC1PHSbits_t;
extern volatile PSMC1PHSbits_t PSMC1PHSbits __at(0x81A);
// bitfield macros
#define _PSMC1PHS_P1PHST_POSN                               0x0
#define _PSMC1PHS_P1PHST_POSITION                           0x0
#define _PSMC1PHS_P1PHST_SIZE                               0x1
#define _PSMC1PHS_P1PHST_LENGTH                             0x1
#define _PSMC1PHS_P1PHST_MASK                               0x1
#define _PSMC1PHS_P1PHSC1_POSN                              0x1
#define _PSMC1PHS_P1PHSC1_POSITION                          0x1
#define _PSMC1PHS_P1PHSC1_SIZE                              0x1
#define _PSMC1PHS_P1PHSC1_LENGTH                            0x1
#define _PSMC1PHS_P1PHSC1_MASK                              0x2
#define _PSMC1PHS_P1PHSC2_POSN                              0x2
#define _PSMC1PHS_P1PHSC2_POSITION                          0x2
#define _PSMC1PHS_P1PHSC2_SIZE                              0x1
#define _PSMC1PHS_P1PHSC2_LENGTH                            0x1
#define _PSMC1PHS_P1PHSC2_MASK                              0x4
#define _PSMC1PHS_P1PHSC3_POSN                              0x3
#define _PSMC1PHS_P1PHSC3_POSITION                          0x3
#define _PSMC1PHS_P1PHSC3_SIZE                              0x1
#define _PSMC1PHS_P1PHSC3_LENGTH                            0x1
#define _PSMC1PHS_P1PHSC3_MASK                              0x8
#define _PSMC1PHS_P1PHSC4_POSN                              0x4
#define _PSMC1PHS_P1PHSC4_POSITION                          0x4
#define _PSMC1PHS_P1PHSC4_SIZE                              0x1
#define _PSMC1PHS_P1PHSC4_LENGTH                            0x1
#define _PSMC1PHS_P1PHSC4_MASK                              0x10
#define _PSMC1PHS_P1PHSIN_POSN                              0x7
#define _PSMC1PHS_P1PHSIN_POSITION                          0x7
#define _PSMC1PHS_P1PHSIN_SIZE                              0x1
#define _PSMC1PHS_P1PHSIN_LENGTH                            0x1
#define _PSMC1PHS_P1PHSIN_MASK                              0x80

// Register: PSMC1DCS
#define PSMC1DCS PSMC1DCS
extern volatile unsigned char           PSMC1DCS            __at(0x81B);
#ifndef _LIB_BUILD
asm("PSMC1DCS equ 081Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1DCST                 :1;
        unsigned P1DCSC1                :1;
        unsigned P1DCSC2                :1;
        unsigned P1DCSC3                :1;
        unsigned P1DCSC4                :1;
        unsigned                        :2;
        unsigned P1DCSIN                :1;
    };
} PSMC1DCSbits_t;
extern volatile PSMC1DCSbits_t PSMC1DCSbits __at(0x81B);
// bitfield macros
#define _PSMC1DCS_P1DCST_POSN                               0x0
#define _PSMC1DCS_P1DCST_POSITION                           0x0
#define _PSMC1DCS_P1DCST_SIZE                               0x1
#define _PSMC1DCS_P1DCST_LENGTH                             0x1
#define _PSMC1DCS_P1DCST_MASK                               0x1
#define _PSMC1DCS_P1DCSC1_POSN                              0x1
#define _PSMC1DCS_P1DCSC1_POSITION                          0x1
#define _PSMC1DCS_P1DCSC1_SIZE                              0x1
#define _PSMC1DCS_P1DCSC1_LENGTH                            0x1
#define _PSMC1DCS_P1DCSC1_MASK                              0x2
#define _PSMC1DCS_P1DCSC2_POSN                              0x2
#define _PSMC1DCS_P1DCSC2_POSITION                          0x2
#define _PSMC1DCS_P1DCSC2_SIZE                              0x1
#define _PSMC1DCS_P1DCSC2_LENGTH                            0x1
#define _PSMC1DCS_P1DCSC2_MASK                              0x4
#define _PSMC1DCS_P1DCSC3_POSN                              0x3
#define _PSMC1DCS_P1DCSC3_POSITION                          0x3
#define _PSMC1DCS_P1DCSC3_SIZE                              0x1
#define _PSMC1DCS_P1DCSC3_LENGTH                            0x1
#define _PSMC1DCS_P1DCSC3_MASK                              0x8
#define _PSMC1DCS_P1DCSC4_POSN                              0x4
#define _PSMC1DCS_P1DCSC4_POSITION                          0x4
#define _PSMC1DCS_P1DCSC4_SIZE                              0x1
#define _PSMC1DCS_P1DCSC4_LENGTH                            0x1
#define _PSMC1DCS_P1DCSC4_MASK                              0x10
#define _PSMC1DCS_P1DCSIN_POSN                              0x7
#define _PSMC1DCS_P1DCSIN_POSITION                          0x7
#define _PSMC1DCS_P1DCSIN_SIZE                              0x1
#define _PSMC1DCS_P1DCSIN_LENGTH                            0x1
#define _PSMC1DCS_P1DCSIN_MASK                              0x80

// Register: PSMC1PRS
#define PSMC1PRS PSMC1PRS
extern volatile unsigned char           PSMC1PRS            __at(0x81C);
#ifndef _LIB_BUILD
asm("PSMC1PRS equ 081Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1PRST                 :1;
        unsigned P1PRSC1                :1;
        unsigned P1PRSC2                :1;
        unsigned P1PRSC3                :1;
        unsigned P1PRSC4                :1;
        unsigned                        :2;
        unsigned P1PRSIN                :1;
    };
} PSMC1PRSbits_t;
extern volatile PSMC1PRSbits_t PSMC1PRSbits __at(0x81C);
// bitfield macros
#define _PSMC1PRS_P1PRST_POSN                               0x0
#define _PSMC1PRS_P1PRST_POSITION                           0x0
#define _PSMC1PRS_P1PRST_SIZE                               0x1
#define _PSMC1PRS_P1PRST_LENGTH                             0x1
#define _PSMC1PRS_P1PRST_MASK                               0x1
#define _PSMC1PRS_P1PRSC1_POSN                              0x1
#define _PSMC1PRS_P1PRSC1_POSITION                          0x1
#define _PSMC1PRS_P1PRSC1_SIZE                              0x1
#define _PSMC1PRS_P1PRSC1_LENGTH                            0x1
#define _PSMC1PRS_P1PRSC1_MASK                              0x2
#define _PSMC1PRS_P1PRSC2_POSN                              0x2
#define _PSMC1PRS_P1PRSC2_POSITION                          0x2
#define _PSMC1PRS_P1PRSC2_SIZE                              0x1
#define _PSMC1PRS_P1PRSC2_LENGTH                            0x1
#define _PSMC1PRS_P1PRSC2_MASK                              0x4
#define _PSMC1PRS_P1PRSC3_POSN                              0x3
#define _PSMC1PRS_P1PRSC3_POSITION                          0x3
#define _PSMC1PRS_P1PRSC3_SIZE                              0x1
#define _PSMC1PRS_P1PRSC3_LENGTH                            0x1
#define _PSMC1PRS_P1PRSC3_MASK                              0x8
#define _PSMC1PRS_P1PRSC4_POSN                              0x4
#define _PSMC1PRS_P1PRSC4_POSITION                          0x4
#define _PSMC1PRS_P1PRSC4_SIZE                              0x1
#define _PSMC1PRS_P1PRSC4_LENGTH                            0x1
#define _PSMC1PRS_P1PRSC4_MASK                              0x10
#define _PSMC1PRS_P1PRSIN_POSN                              0x7
#define _PSMC1PRS_P1PRSIN_POSITION                          0x7
#define _PSMC1PRS_P1PRSIN_SIZE                              0x1
#define _PSMC1PRS_P1PRSIN_LENGTH                            0x1
#define _PSMC1PRS_P1PRSIN_MASK                              0x80

// Register: PSMC1ASDC
#define PSMC1ASDC PSMC1ASDC
extern volatile unsigned char           PSMC1ASDC           __at(0x81D);
#ifndef _LIB_BUILD
asm("PSMC1ASDC equ 081Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1ASDOV                :1;
        unsigned                        :4;
        unsigned P1ARSEN                :1;
        unsigned P1ASDEN                :1;
        unsigned P1ASE                  :1;
    };
} PSMC1ASDCbits_t;
