MikroElektronika/core_packages/PIC/XC8/def/PIC16F1786/mcu.h
extern volatile PSMC1INTbits_t PSMC1INTbits __at(0x820);
// bitfield macros
#define _PSMC1INT_P1TPRIF_POSN                              0x0
#define _PSMC1INT_P1TPRIF_POSITION                          0x0
#define _PSMC1INT_P1TPRIF_SIZE                              0x1
#define _PSMC1INT_P1TPRIF_LENGTH                            0x1
#define _PSMC1INT_P1TPRIF_MASK                              0x1
#define _PSMC1INT_P1TDCIF_POSN                              0x1
#define _PSMC1INT_P1TDCIF_POSITION                          0x1
#define _PSMC1INT_P1TDCIF_SIZE                              0x1
#define _PSMC1INT_P1TDCIF_LENGTH                            0x1
#define _PSMC1INT_P1TDCIF_MASK                              0x2
#define _PSMC1INT_P1TPHIF_POSN                              0x2
#define _PSMC1INT_P1TPHIF_POSITION                          0x2
#define _PSMC1INT_P1TPHIF_SIZE                              0x1
#define _PSMC1INT_P1TPHIF_LENGTH                            0x1
#define _PSMC1INT_P1TPHIF_MASK                              0x4
#define _PSMC1INT_P1TOVIF_POSN                              0x3
#define _PSMC1INT_P1TOVIF_POSITION                          0x3
#define _PSMC1INT_P1TOVIF_SIZE                              0x1
#define _PSMC1INT_P1TOVIF_LENGTH                            0x1
#define _PSMC1INT_P1TOVIF_MASK                              0x8
#define _PSMC1INT_P1TPRIE_POSN                              0x4
#define _PSMC1INT_P1TPRIE_POSITION                          0x4
#define _PSMC1INT_P1TPRIE_SIZE                              0x1
#define _PSMC1INT_P1TPRIE_LENGTH                            0x1
#define _PSMC1INT_P1TPRIE_MASK                              0x10
#define _PSMC1INT_P1TDCIE_POSN                              0x5
#define _PSMC1INT_P1TDCIE_POSITION                          0x5
#define _PSMC1INT_P1TDCIE_SIZE                              0x1
#define _PSMC1INT_P1TDCIE_LENGTH                            0x1
#define _PSMC1INT_P1TDCIE_MASK                              0x20
#define _PSMC1INT_P1TPHIE_POSN                              0x6
#define _PSMC1INT_P1TPHIE_POSITION                          0x6
#define _PSMC1INT_P1TPHIE_SIZE                              0x1
#define _PSMC1INT_P1TPHIE_LENGTH                            0x1
#define _PSMC1INT_P1TPHIE_MASK                              0x40
#define _PSMC1INT_P1TOVIE_POSN                              0x7
#define _PSMC1INT_P1TOVIE_POSITION                          0x7
#define _PSMC1INT_P1TOVIE_SIZE                              0x1
#define _PSMC1INT_P1TOVIE_LENGTH                            0x1
#define _PSMC1INT_P1TOVIE_MASK                              0x80

// Register: PSMC1PH
#define PSMC1PH PSMC1PH
extern volatile unsigned short          PSMC1PH             __at(0x821);
#ifndef _LIB_BUILD
asm("PSMC1PH equ 0821h");
#endif

// Register: PSMC1PHL
#define PSMC1PHL PSMC1PHL
extern volatile unsigned char           PSMC1PHL            __at(0x821);
#ifndef _LIB_BUILD
asm("PSMC1PHL equ 0821h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1PH0               :1;
        unsigned PSMC1PH1               :1;
        unsigned PSMC1PH2               :1;
        unsigned PSMC1PH3               :1;
        unsigned PSMC1PH4               :1;
        unsigned PSMC1PH5               :1;
        unsigned PSMC1PH6               :1;
        unsigned PSMC1PH7               :1;
    };
} PSMC1PHLbits_t;
extern volatile PSMC1PHLbits_t PSMC1PHLbits __at(0x821);
// bitfield macros
#define _PSMC1PHL_PSMC1PH0_POSN                             0x0
#define _PSMC1PHL_PSMC1PH0_POSITION                         0x0
#define _PSMC1PHL_PSMC1PH0_SIZE                             0x1
#define _PSMC1PHL_PSMC1PH0_LENGTH                           0x1
#define _PSMC1PHL_PSMC1PH0_MASK                             0x1
#define _PSMC1PHL_PSMC1PH1_POSN                             0x1
#define _PSMC1PHL_PSMC1PH1_POSITION                         0x1
#define _PSMC1PHL_PSMC1PH1_SIZE                             0x1
#define _PSMC1PHL_PSMC1PH1_LENGTH                           0x1
#define _PSMC1PHL_PSMC1PH1_MASK                             0x2
#define _PSMC1PHL_PSMC1PH2_POSN                             0x2
#define _PSMC1PHL_PSMC1PH2_POSITION                         0x2
#define _PSMC1PHL_PSMC1PH2_SIZE                             0x1
#define _PSMC1PHL_PSMC1PH2_LENGTH                           0x1
#define _PSMC1PHL_PSMC1PH2_MASK                             0x4
#define _PSMC1PHL_PSMC1PH3_POSN                             0x3
#define _PSMC1PHL_PSMC1PH3_POSITION                         0x3
#define _PSMC1PHL_PSMC1PH3_SIZE                             0x1
#define _PSMC1PHL_PSMC1PH3_LENGTH                           0x1
#define _PSMC1PHL_PSMC1PH3_MASK                             0x8
#define _PSMC1PHL_PSMC1PH4_POSN                             0x4
#define _PSMC1PHL_PSMC1PH4_POSITION                         0x4
#define _PSMC1PHL_PSMC1PH4_SIZE                             0x1
#define _PSMC1PHL_PSMC1PH4_LENGTH                           0x1
#define _PSMC1PHL_PSMC1PH4_MASK                             0x10
#define _PSMC1PHL_PSMC1PH5_POSN                             0x5
#define _PSMC1PHL_PSMC1PH5_POSITION                         0x5
#define _PSMC1PHL_PSMC1PH5_SIZE                             0x1
#define _PSMC1PHL_PSMC1PH5_LENGTH                           0x1
#define _PSMC1PHL_PSMC1PH5_MASK                             0x20
#define _PSMC1PHL_PSMC1PH6_POSN                             0x6
#define _PSMC1PHL_PSMC1PH6_POSITION                         0x6
#define _PSMC1PHL_PSMC1PH6_SIZE                             0x1
#define _PSMC1PHL_PSMC1PH6_LENGTH                           0x1
#define _PSMC1PHL_PSMC1PH6_MASK                             0x40
#define _PSMC1PHL_PSMC1PH7_POSN                             0x7
#define _PSMC1PHL_PSMC1PH7_POSITION                         0x7
#define _PSMC1PHL_PSMC1PH7_SIZE                             0x1
#define _PSMC1PHL_PSMC1PH7_LENGTH                           0x1
#define _PSMC1PHL_PSMC1PH7_MASK                             0x80

