MikroElektronika/core_packages/PIC/XC8/def/PIC16F1786/mcu.h
extern volatile PSMC1STR0bits_t PSMC1STR0bits __at(0x82E);
// bitfield macros
#define _PSMC1STR0_P1STRA_POSN                              0x0
#define _PSMC1STR0_P1STRA_POSITION                          0x0
#define _PSMC1STR0_P1STRA_SIZE                              0x1
#define _PSMC1STR0_P1STRA_LENGTH                            0x1
#define _PSMC1STR0_P1STRA_MASK                              0x1
#define _PSMC1STR0_P1STRB_POSN                              0x1
#define _PSMC1STR0_P1STRB_POSITION                          0x1
#define _PSMC1STR0_P1STRB_SIZE                              0x1
#define _PSMC1STR0_P1STRB_LENGTH                            0x1
#define _PSMC1STR0_P1STRB_MASK                              0x2
#define _PSMC1STR0_P1STRC_POSN                              0x2
#define _PSMC1STR0_P1STRC_POSITION                          0x2
#define _PSMC1STR0_P1STRC_SIZE                              0x1
#define _PSMC1STR0_P1STRC_LENGTH                            0x1
#define _PSMC1STR0_P1STRC_MASK                              0x4
#define _PSMC1STR0_P1STRD_POSN                              0x3
#define _PSMC1STR0_P1STRD_POSITION                          0x3
#define _PSMC1STR0_P1STRD_SIZE                              0x1
#define _PSMC1STR0_P1STRD_LENGTH                            0x1
#define _PSMC1STR0_P1STRD_MASK                              0x8
#define _PSMC1STR0_P1STRE_POSN                              0x4
#define _PSMC1STR0_P1STRE_POSITION                          0x4
#define _PSMC1STR0_P1STRE_SIZE                              0x1
#define _PSMC1STR0_P1STRE_LENGTH                            0x1
#define _PSMC1STR0_P1STRE_MASK                              0x10
#define _PSMC1STR0_P1STRF_POSN                              0x5
#define _PSMC1STR0_P1STRF_POSITION                          0x5
#define _PSMC1STR0_P1STRF_SIZE                              0x1
#define _PSMC1STR0_P1STRF_LENGTH                            0x1
#define _PSMC1STR0_P1STRF_MASK                              0x20

// Register: PSMC1STR1
#define PSMC1STR1 PSMC1STR1
extern volatile unsigned char           PSMC1STR1           __at(0x82F);
#ifndef _LIB_BUILD
asm("PSMC1STR1 equ 082Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1HSMEN                :1;
        unsigned P1LSMEN                :1;
        unsigned                        :5;
        unsigned P1SSYNC                :1;
    };
} PSMC1STR1bits_t;
extern volatile PSMC1STR1bits_t PSMC1STR1bits __at(0x82F);
// bitfield macros
#define _PSMC1STR1_P1HSMEN_POSN                             0x0
#define _PSMC1STR1_P1HSMEN_POSITION                         0x0
#define _PSMC1STR1_P1HSMEN_SIZE                             0x1
#define _PSMC1STR1_P1HSMEN_LENGTH                           0x1
#define _PSMC1STR1_P1HSMEN_MASK                             0x1
#define _PSMC1STR1_P1LSMEN_POSN                             0x1
#define _PSMC1STR1_P1LSMEN_POSITION                         0x1
#define _PSMC1STR1_P1LSMEN_SIZE                             0x1
#define _PSMC1STR1_P1LSMEN_LENGTH                           0x1
#define _PSMC1STR1_P1LSMEN_MASK                             0x2
#define _PSMC1STR1_P1SSYNC_POSN                             0x7
#define _PSMC1STR1_P1SSYNC_POSITION                         0x7
#define _PSMC1STR1_P1SSYNC_SIZE                             0x1
#define _PSMC1STR1_P1SSYNC_LENGTH                           0x1
#define _PSMC1STR1_P1SSYNC_MASK                             0x80

// Register: PSMC2CON
#define PSMC2CON PSMC2CON
extern volatile unsigned char           PSMC2CON            __at(0x831);
#ifndef _LIB_BUILD
asm("PSMC2CON equ 0831h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2MODE                 :4;
        unsigned P2DBRE                 :1;
        unsigned P2DBFE                 :1;
        unsigned PSMC2LD                :1;
        unsigned PSMC2EN                :1;
    };
    struct {
        unsigned P2MODE0                :1;
        unsigned P2MODE1                :1;
        unsigned P2MODE2                :1;
        unsigned P2MODE3                :1;
    };
} PSMC2CONbits_t;
extern volatile PSMC2CONbits_t PSMC2CONbits __at(0x831);
// bitfield macros
#define _PSMC2CON_P2MODE_POSN                               0x0
#define _PSMC2CON_P2MODE_POSITION                           0x0
#define _PSMC2CON_P2MODE_SIZE                               0x4
#define _PSMC2CON_P2MODE_LENGTH                             0x4
#define _PSMC2CON_P2MODE_MASK                               0xF
#define _PSMC2CON_P2DBRE_POSN                               0x4
#define _PSMC2CON_P2DBRE_POSITION                           0x4
#define _PSMC2CON_P2DBRE_SIZE                               0x1
#define _PSMC2CON_P2DBRE_LENGTH                             0x1
#define _PSMC2CON_P2DBRE_MASK                               0x10
#define _PSMC2CON_P2DBFE_POSN                               0x5
#define _PSMC2CON_P2DBFE_POSITION                           0x5
#define _PSMC2CON_P2DBFE_SIZE                               0x1
#define _PSMC2CON_P2DBFE_LENGTH                             0x1
#define _PSMC2CON_P2DBFE_MASK                               0x20
#define _PSMC2CON_PSMC2LD_POSN                              0x6
#define _PSMC2CON_PSMC2LD_POSITION                          0x6
#define _PSMC2CON_PSMC2LD_SIZE                              0x1
#define _PSMC2CON_PSMC2LD_LENGTH                            0x1
#define _PSMC2CON_PSMC2LD_MASK                              0x40
#define _PSMC2CON_PSMC2EN_POSN                              0x7
#define _PSMC2CON_PSMC2EN_POSITION                          0x7
#define _PSMC2CON_PSMC2EN_SIZE                              0x1
#define _PSMC2CON_PSMC2EN_LENGTH                            0x1
#define _PSMC2CON_PSMC2EN_MASK                              0x80
#define _PSMC2CON_P2MODE0_POSN                              0x0
#define _PSMC2CON_P2MODE0_POSITION                          0x0
#define _PSMC2CON_P2MODE0_SIZE                              0x1
#define _PSMC2CON_P2MODE0_LENGTH                            0x1
#define _PSMC2CON_P2MODE0_MASK                              0x1
#define _PSMC2CON_P2MODE1_POSN                              0x1
#define _PSMC2CON_P2MODE1_POSITION                          0x1
#define _PSMC2CON_P2MODE1_SIZE                              0x1
#define _PSMC2CON_P2MODE1_LENGTH                            0x1
#define _PSMC2CON_P2MODE1_MASK                              0x2
#define _PSMC2CON_P2MODE2_POSN                              0x2
#define _PSMC2CON_P2MODE2_POSITION                          0x2
#define _PSMC2CON_P2MODE2_SIZE                              0x1
#define _PSMC2CON_P2MODE2_LENGTH                            0x1
#define _PSMC2CON_P2MODE2_MASK                              0x4
#define _PSMC2CON_P2MODE3_POSN                              0x3
#define _PSMC2CON_P2MODE3_POSITION                          0x3
#define _PSMC2CON_P2MODE3_SIZE                              0x1
#define _PSMC2CON_P2MODE3_LENGTH                            0x1
#define _PSMC2CON_P2MODE3_MASK                              0x8

