MikroElektronika/core_packages/PIC/XC8/def/PIC16F1786/mcu.h
// Register: PSMC3CLK
#define PSMC3CLK PSMC3CLK
extern volatile unsigned char           PSMC3CLK            __at(0x854);
#ifndef _LIB_BUILD
asm("PSMC3CLK equ 0854h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3CSRC0                :1;
        unsigned P3CSRC1                :1;
        unsigned                        :2;
        unsigned P3CPRE0                :1;
        unsigned P3CPRE1                :1;
    };
    struct {
        unsigned P3CSRC                 :2;
        unsigned                        :2;
        unsigned P3CPRE                 :2;
    };
} PSMC3CLKbits_t;
extern volatile PSMC3CLKbits_t PSMC3CLKbits __at(0x854);
// bitfield macros
#define _PSMC3CLK_P3CSRC0_POSN                              0x0
#define _PSMC3CLK_P3CSRC0_POSITION                          0x0
#define _PSMC3CLK_P3CSRC0_SIZE                              0x1
#define _PSMC3CLK_P3CSRC0_LENGTH                            0x1
#define _PSMC3CLK_P3CSRC0_MASK                              0x1
#define _PSMC3CLK_P3CSRC1_POSN                              0x1
#define _PSMC3CLK_P3CSRC1_POSITION                          0x1
#define _PSMC3CLK_P3CSRC1_SIZE                              0x1
#define _PSMC3CLK_P3CSRC1_LENGTH                            0x1
#define _PSMC3CLK_P3CSRC1_MASK                              0x2
#define _PSMC3CLK_P3CPRE0_POSN                              0x4
#define _PSMC3CLK_P3CPRE0_POSITION                          0x4
#define _PSMC3CLK_P3CPRE0_SIZE                              0x1
#define _PSMC3CLK_P3CPRE0_LENGTH                            0x1
#define _PSMC3CLK_P3CPRE0_MASK                              0x10
#define _PSMC3CLK_P3CPRE1_POSN                              0x5
#define _PSMC3CLK_P3CPRE1_POSITION                          0x5
#define _PSMC3CLK_P3CPRE1_SIZE                              0x1
#define _PSMC3CLK_P3CPRE1_LENGTH                            0x1
#define _PSMC3CLK_P3CPRE1_MASK                              0x20
#define _PSMC3CLK_P3CSRC_POSN                               0x0
#define _PSMC3CLK_P3CSRC_POSITION                           0x0
#define _PSMC3CLK_P3CSRC_SIZE                               0x2
#define _PSMC3CLK_P3CSRC_LENGTH                             0x2
#define _PSMC3CLK_P3CSRC_MASK                               0x3
#define _PSMC3CLK_P3CPRE_POSN                               0x4
#define _PSMC3CLK_P3CPRE_POSITION                           0x4
#define _PSMC3CLK_P3CPRE_SIZE                               0x2
#define _PSMC3CLK_P3CPRE_LENGTH                             0x2
#define _PSMC3CLK_P3CPRE_MASK                               0x30

// Register: PSMC3OEN
#define PSMC3OEN PSMC3OEN
extern volatile unsigned char           PSMC3OEN            __at(0x855);
#ifndef _LIB_BUILD
asm("PSMC3OEN equ 0855h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3OEA                  :1;
        unsigned P3OEB                  :1;
    };
} PSMC3OENbits_t;
extern volatile PSMC3OENbits_t PSMC3OENbits __at(0x855);
// bitfield macros
#define _PSMC3OEN_P3OEA_POSN                                0x0
#define _PSMC3OEN_P3OEA_POSITION                            0x0
#define _PSMC3OEN_P3OEA_SIZE                                0x1
#define _PSMC3OEN_P3OEA_LENGTH                              0x1
#define _PSMC3OEN_P3OEA_MASK                                0x1
#define _PSMC3OEN_P3OEB_POSN                                0x1
#define _PSMC3OEN_P3OEB_POSITION                            0x1
#define _PSMC3OEN_P3OEB_SIZE                                0x1
#define _PSMC3OEN_P3OEB_LENGTH                              0x1
#define _PSMC3OEN_P3OEB_MASK                                0x2

// Register: PSMC3POL
#define PSMC3POL PSMC3POL
extern volatile unsigned char           PSMC3POL            __at(0x856);
#ifndef _LIB_BUILD
asm("PSMC3POL equ 0856h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3POLA                 :1;
        unsigned P3POLB                 :1;
        unsigned                        :4;
        unsigned P3INPOL                :1;
    };
} PSMC3POLbits_t;
extern volatile PSMC3POLbits_t PSMC3POLbits __at(0x856);
// bitfield macros
#define _PSMC3POL_P3POLA_POSN                               0x0
#define _PSMC3POL_P3POLA_POSITION                           0x0
#define _PSMC3POL_P3POLA_SIZE                               0x1
#define _PSMC3POL_P3POLA_LENGTH                             0x1
#define _PSMC3POL_P3POLA_MASK                               0x1
#define _PSMC3POL_P3POLB_POSN                               0x1
#define _PSMC3POL_P3POLB_POSITION                           0x1
#define _PSMC3POL_P3POLB_SIZE                               0x1
#define _PSMC3POL_P3POLB_LENGTH                             0x1
#define _PSMC3POL_P3POLB_MASK                               0x2
#define _PSMC3POL_P3INPOL_POSN                              0x6
#define _PSMC3POL_P3INPOL_POSITION                          0x6
#define _PSMC3POL_P3INPOL_SIZE                              0x1
#define _PSMC3POL_P3INPOL_LENGTH                            0x1
#define _PSMC3POL_P3INPOL_MASK                              0x40

// Register: PSMC3BLNK
#define PSMC3BLNK PSMC3BLNK
extern volatile unsigned char           PSMC3BLNK           __at(0x857);
#ifndef _LIB_BUILD
asm("PSMC3BLNK equ 0857h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3REBM                 :2;
        unsigned                        :2;
        unsigned P3FEBM                 :2;
    };
    struct {
        unsigned P3REBM0                :1;
        unsigned P3REBM1                :1;
        unsigned                        :2;
        unsigned P3FEBM0                :1;
        unsigned P3FEBM1                :1;
    };
} PSMC3BLNKbits_t;
extern volatile PSMC3BLNKbits_t PSMC3BLNKbits __at(0x857);
// bitfield macros
#define _PSMC3BLNK_P3REBM_POSN                              0x0
#define _PSMC3BLNK_P3REBM_POSITION                          0x0
#define _PSMC3BLNK_P3REBM_SIZE                              0x2
#define _PSMC3BLNK_P3REBM_LENGTH                            0x2
#define _PSMC3BLNK_P3REBM_MASK                              0x3
#define _PSMC3BLNK_P3FEBM_POSN                              0x4
#define _PSMC3BLNK_P3FEBM_POSITION                          0x4
#define _PSMC3BLNK_P3FEBM_SIZE                              0x2
#define _PSMC3BLNK_P3FEBM_LENGTH                            0x2
#define _PSMC3BLNK_P3FEBM_MASK                              0x30
#define _PSMC3BLNK_P3REBM0_POSN                             0x0
#define _PSMC3BLNK_P3REBM0_POSITION                         0x0
#define _PSMC3BLNK_P3REBM0_SIZE                             0x1
#define _PSMC3BLNK_P3REBM0_LENGTH                           0x1
#define _PSMC3BLNK_P3REBM0_MASK                             0x1
#define _PSMC3BLNK_P3REBM1_POSN                             0x1
#define _PSMC3BLNK_P3REBM1_POSITION                         0x1
#define _PSMC3BLNK_P3REBM1_SIZE                             0x1
#define _PSMC3BLNK_P3REBM1_LENGTH                           0x1
#define _PSMC3BLNK_P3REBM1_MASK                             0x2
#define _PSMC3BLNK_P3FEBM0_POSN                             0x4
#define _PSMC3BLNK_P3FEBM0_POSITION                         0x4
#define _PSMC3BLNK_P3FEBM0_SIZE                             0x1
#define _PSMC3BLNK_P3FEBM0_LENGTH                           0x1
#define _PSMC3BLNK_P3FEBM0_MASK                             0x10
#define _PSMC3BLNK_P3FEBM1_POSN                             0x5
#define _PSMC3BLNK_P3FEBM1_POSITION                         0x5
#define _PSMC3BLNK_P3FEBM1_SIZE                             0x1
#define _PSMC3BLNK_P3FEBM1_LENGTH                           0x1
#define _PSMC3BLNK_P3FEBM1_MASK                             0x20

// Register: PSMC3REBS
#define PSMC3REBS PSMC3REBS
extern volatile unsigned char           PSMC3REBS           __at(0x858);
#ifndef _LIB_BUILD
asm("PSMC3REBS equ 0858h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P3REBSC1               :1;
        unsigned P3REBSC2               :1;
        unsigned P3REBSC3               :1;
        unsigned P3REBSC4               :1;
        unsigned                        :2;
        unsigned P3REBSIN               :1;
    };
} PSMC3REBSbits_t;
extern volatile PSMC3REBSbits_t PSMC3REBSbits __at(0x858);
// bitfield macros
#define _PSMC3REBS_P3REBSC1_POSN                            0x1
#define _PSMC3REBS_P3REBSC1_POSITION                        0x1
#define _PSMC3REBS_P3REBSC1_SIZE                            0x1
#define _PSMC3REBS_P3REBSC1_LENGTH                          0x1
#define _PSMC3REBS_P3REBSC1_MASK                            0x2
#define _PSMC3REBS_P3REBSC2_POSN                            0x2
#define _PSMC3REBS_P3REBSC2_POSITION                        0x2
#define _PSMC3REBS_P3REBSC2_SIZE                            0x1
#define _PSMC3REBS_P3REBSC2_LENGTH                          0x1
#define _PSMC3REBS_P3REBSC2_MASK                            0x4
#define _PSMC3REBS_P3REBSC3_POSN                            0x3
#define _PSMC3REBS_P3REBSC3_POSITION                        0x3
#define _PSMC3REBS_P3REBSC3_SIZE                            0x1
#define _PSMC3REBS_P3REBSC3_LENGTH                          0x1
#define _PSMC3REBS_P3REBSC3_MASK                            0x8
#define _PSMC3REBS_P3REBSC4_POSN                            0x4
#define _PSMC3REBS_P3REBSC4_POSITION                        0x4
#define _PSMC3REBS_P3REBSC4_SIZE                            0x1
#define _PSMC3REBS_P3REBSC4_LENGTH                          0x1
#define _PSMC3REBS_P3REBSC4_MASK                            0x10
#define _PSMC3REBS_P3REBSIN_POSN                            0x7
#define _PSMC3REBS_P3REBSIN_POSITION                        0x7
#define _PSMC3REBS_P3REBSIN_SIZE                            0x1
#define _PSMC3REBS_P3REBSIN_LENGTH                          0x1
#define _PSMC3REBS_P3REBSIN_MASK                            0x80

// Register: PSMC3FEBS
#define PSMC3FEBS PSMC3FEBS
extern volatile unsigned char           PSMC3FEBS           __at(0x859);
#ifndef _LIB_BUILD
asm("PSMC3FEBS equ 0859h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P3FEBSC1               :1;
        unsigned P3FEBSC2               :1;
        unsigned P3FEBSC3               :1;
        unsigned P3FEBSC4               :1;
        unsigned                        :2;
        unsigned P3FEBSIN               :1;
    };
} PSMC3FEBSbits_t;
extern volatile PSMC3FEBSbits_t PSMC3FEBSbits __at(0x859);
// bitfield macros
#define _PSMC3FEBS_P3FEBSC1_POSN                            0x1
#define _PSMC3FEBS_P3FEBSC1_POSITION                        0x1
#define _PSMC3FEBS_P3FEBSC1_SIZE                            0x1
#define _PSMC3FEBS_P3FEBSC1_LENGTH                          0x1
#define _PSMC3FEBS_P3FEBSC1_MASK                            0x2
#define _PSMC3FEBS_P3FEBSC2_POSN                            0x2
#define _PSMC3FEBS_P3FEBSC2_POSITION                        0x2
#define _PSMC3FEBS_P3FEBSC2_SIZE                            0x1
#define _PSMC3FEBS_P3FEBSC2_LENGTH                          0x1
#define _PSMC3FEBS_P3FEBSC2_MASK                            0x4
#define _PSMC3FEBS_P3FEBSC3_POSN                            0x3
#define _PSMC3FEBS_P3FEBSC3_POSITION                        0x3
#define _PSMC3FEBS_P3FEBSC3_SIZE                            0x1
#define _PSMC3FEBS_P3FEBSC3_LENGTH                          0x1
#define _PSMC3FEBS_P3FEBSC3_MASK                            0x8
#define _PSMC3FEBS_P3FEBSC4_POSN                            0x4
#define _PSMC3FEBS_P3FEBSC4_POSITION                        0x4
#define _PSMC3FEBS_P3FEBSC4_SIZE                            0x1
#define _PSMC3FEBS_P3FEBSC4_LENGTH                          0x1
#define _PSMC3FEBS_P3FEBSC4_MASK                            0x10
#define _PSMC3FEBS_P3FEBSIN_POSN                            0x7
#define _PSMC3FEBS_P3FEBSIN_POSITION                        0x7
#define _PSMC3FEBS_P3FEBSIN_SIZE                            0x1
#define _PSMC3FEBS_P3FEBSIN_LENGTH                          0x1
#define _PSMC3FEBS_P3FEBSIN_MASK                            0x80

// Register: PSMC3PHS
#define PSMC3PHS PSMC3PHS
extern volatile unsigned char           PSMC3PHS            __at(0x85A);
#ifndef _LIB_BUILD
asm("PSMC3PHS equ 085Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3PHST                 :1;
        unsigned P3PHSC1                :1;
        unsigned P3PHSC2                :1;
        unsigned P3PHSC3                :1;
        unsigned P3PHSC4                :1;
        unsigned                        :2;
        unsigned P3PHSIN                :1;
    };
} PSMC3PHSbits_t;
extern volatile PSMC3PHSbits_t PSMC3PHSbits __at(0x85A);
// bitfield macros
#define _PSMC3PHS_P3PHST_POSN                               0x0
#define _PSMC3PHS_P3PHST_POSITION                           0x0
#define _PSMC3PHS_P3PHST_SIZE                               0x1
#define _PSMC3PHS_P3PHST_LENGTH                             0x1
#define _PSMC3PHS_P3PHST_MASK                               0x1
#define _PSMC3PHS_P3PHSC1_POSN                              0x1
#define _PSMC3PHS_P3PHSC1_POSITION                          0x1
#define _PSMC3PHS_P3PHSC1_SIZE                              0x1
#define _PSMC3PHS_P3PHSC1_LENGTH                            0x1
#define _PSMC3PHS_P3PHSC1_MASK                              0x2
#define _PSMC3PHS_P3PHSC2_POSN                              0x2
#define _PSMC3PHS_P3PHSC2_POSITION                          0x2
#define _PSMC3PHS_P3PHSC2_SIZE                              0x1
#define _PSMC3PHS_P3PHSC2_LENGTH                            0x1
#define _PSMC3PHS_P3PHSC2_MASK                              0x4
#define _PSMC3PHS_P3PHSC3_POSN                              0x3
#define _PSMC3PHS_P3PHSC3_POSITION                          0x3
#define _PSMC3PHS_P3PHSC3_SIZE                              0x1
#define _PSMC3PHS_P3PHSC3_LENGTH                            0x1
#define _PSMC3PHS_P3PHSC3_MASK                              0x8
#define _PSMC3PHS_P3PHSC4_POSN                              0x4
#define _PSMC3PHS_P3PHSC4_POSITION                          0x4
#define _PSMC3PHS_P3PHSC4_SIZE                              0x1
#define _PSMC3PHS_P3PHSC4_LENGTH                            0x1
#define _PSMC3PHS_P3PHSC4_MASK                              0x10
#define _PSMC3PHS_P3PHSIN_POSN                              0x7
#define _PSMC3PHS_P3PHSIN_POSITION                          0x7
#define _PSMC3PHS_P3PHSIN_SIZE                              0x1
#define _PSMC3PHS_P3PHSIN_LENGTH                            0x1
#define _PSMC3PHS_P3PHSIN_MASK                              0x80

