MikroElektronika/core_packages/PIC/XC8/def/PIC16F1786/mcu.h
// Register: PSMC3PH
#define PSMC3PH PSMC3PH
extern volatile unsigned short          PSMC3PH             __at(0x861);
#ifndef _LIB_BUILD
asm("PSMC3PH equ 0861h");
#endif

// Register: PSMC3PHL
#define PSMC3PHL PSMC3PHL
extern volatile unsigned char           PSMC3PHL            __at(0x861);
#ifndef _LIB_BUILD
asm("PSMC3PHL equ 0861h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3PH0               :1;
        unsigned PSMC3PH1               :1;
        unsigned PSMC3PH2               :1;
        unsigned PSMC3PH3               :1;
        unsigned PSMC3PH4               :1;
        unsigned PSMC3PH5               :1;
        unsigned PSMC3PH6               :1;
        unsigned PSMC3PH7               :1;
    };
} PSMC3PHLbits_t;
extern volatile PSMC3PHLbits_t PSMC3PHLbits __at(0x861);
// bitfield macros
#define _PSMC3PHL_PSMC3PH0_POSN                             0x0
#define _PSMC3PHL_PSMC3PH0_POSITION                         0x0
#define _PSMC3PHL_PSMC3PH0_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH0_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH0_MASK                             0x1
#define _PSMC3PHL_PSMC3PH1_POSN                             0x1
#define _PSMC3PHL_PSMC3PH1_POSITION                         0x1
#define _PSMC3PHL_PSMC3PH1_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH1_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH1_MASK                             0x2
#define _PSMC3PHL_PSMC3PH2_POSN                             0x2
#define _PSMC3PHL_PSMC3PH2_POSITION                         0x2
#define _PSMC3PHL_PSMC3PH2_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH2_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH2_MASK                             0x4
#define _PSMC3PHL_PSMC3PH3_POSN                             0x3
#define _PSMC3PHL_PSMC3PH3_POSITION                         0x3
#define _PSMC3PHL_PSMC3PH3_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH3_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH3_MASK                             0x8
#define _PSMC3PHL_PSMC3PH4_POSN                             0x4
#define _PSMC3PHL_PSMC3PH4_POSITION                         0x4
#define _PSMC3PHL_PSMC3PH4_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH4_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH4_MASK                             0x10
#define _PSMC3PHL_PSMC3PH5_POSN                             0x5
#define _PSMC3PHL_PSMC3PH5_POSITION                         0x5
#define _PSMC3PHL_PSMC3PH5_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH5_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH5_MASK                             0x20
#define _PSMC3PHL_PSMC3PH6_POSN                             0x6
#define _PSMC3PHL_PSMC3PH6_POSITION                         0x6
#define _PSMC3PHL_PSMC3PH6_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH6_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH6_MASK                             0x40
#define _PSMC3PHL_PSMC3PH7_POSN                             0x7
#define _PSMC3PHL_PSMC3PH7_POSITION                         0x7
#define _PSMC3PHL_PSMC3PH7_SIZE                             0x1
#define _PSMC3PHL_PSMC3PH7_LENGTH                           0x1
#define _PSMC3PHL_PSMC3PH7_MASK                             0x80

// Register: PSMC3PHH
#define PSMC3PHH PSMC3PHH
extern volatile unsigned char           PSMC3PHH            __at(0x862);
#ifndef _LIB_BUILD
asm("PSMC3PHH equ 0862h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3PH8               :1;
        unsigned PSMC3PH9               :1;
        unsigned PSMC3PH10              :1;
        unsigned PSMC3PH11              :1;
        unsigned PSMC3PH12              :1;
        unsigned PSMC3PH13              :1;
        unsigned PSMC3PH14              :1;
        unsigned PSMC3PH15              :1;
    };
} PSMC3PHHbits_t;
extern volatile PSMC3PHHbits_t PSMC3PHHbits __at(0x862);
// bitfield macros
#define _PSMC3PHH_PSMC3PH8_POSN                             0x0
#define _PSMC3PHH_PSMC3PH8_POSITION                         0x0
#define _PSMC3PHH_PSMC3PH8_SIZE                             0x1
#define _PSMC3PHH_PSMC3PH8_LENGTH                           0x1
#define _PSMC3PHH_PSMC3PH8_MASK                             0x1
#define _PSMC3PHH_PSMC3PH9_POSN                             0x1
#define _PSMC3PHH_PSMC3PH9_POSITION                         0x1
#define _PSMC3PHH_PSMC3PH9_SIZE                             0x1
#define _PSMC3PHH_PSMC3PH9_LENGTH                           0x1
#define _PSMC3PHH_PSMC3PH9_MASK                             0x2
#define _PSMC3PHH_PSMC3PH10_POSN                            0x2
#define _PSMC3PHH_PSMC3PH10_POSITION                        0x2
#define _PSMC3PHH_PSMC3PH10_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH10_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH10_MASK                            0x4
#define _PSMC3PHH_PSMC3PH11_POSN                            0x3
#define _PSMC3PHH_PSMC3PH11_POSITION                        0x3
#define _PSMC3PHH_PSMC3PH11_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH11_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH11_MASK                            0x8
#define _PSMC3PHH_PSMC3PH12_POSN                            0x4
#define _PSMC3PHH_PSMC3PH12_POSITION                        0x4
#define _PSMC3PHH_PSMC3PH12_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH12_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH12_MASK                            0x10
#define _PSMC3PHH_PSMC3PH13_POSN                            0x5
#define _PSMC3PHH_PSMC3PH13_POSITION                        0x5
#define _PSMC3PHH_PSMC3PH13_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH13_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH13_MASK                            0x20
#define _PSMC3PHH_PSMC3PH14_POSN                            0x6
#define _PSMC3PHH_PSMC3PH14_POSITION                        0x6
#define _PSMC3PHH_PSMC3PH14_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH14_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH14_MASK                            0x40
#define _PSMC3PHH_PSMC3PH15_POSN                            0x7
#define _PSMC3PHH_PSMC3PH15_POSITION                        0x7
#define _PSMC3PHH_PSMC3PH15_SIZE                            0x1
#define _PSMC3PHH_PSMC3PH15_LENGTH                          0x1
#define _PSMC3PHH_PSMC3PH15_MASK                            0x80

// Register: PSMC3DC
#define PSMC3DC PSMC3DC
extern volatile unsigned short          PSMC3DC             __at(0x863);
#ifndef _LIB_BUILD
asm("PSMC3DC equ 0863h");
#endif

// Register: PSMC3DCL
#define PSMC3DCL PSMC3DCL
extern volatile unsigned char           PSMC3DCL            __at(0x863);
#ifndef _LIB_BUILD
asm("PSMC3DCL equ 0863h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3DC0               :1;
        unsigned PSMC3DC1               :1;
        unsigned PSMC3DC2               :1;
        unsigned PSMC3DC3               :1;
        unsigned PSMC3DC4               :1;
        unsigned PSMC3DC5               :1;
        unsigned PSMC3DC6               :1;
        unsigned PSMC3DC7               :1;
    };
} PSMC3DCLbits_t;
extern volatile PSMC3DCLbits_t PSMC3DCLbits __at(0x863);
// bitfield macros
#define _PSMC3DCL_PSMC3DC0_POSN                             0x0
#define _PSMC3DCL_PSMC3DC0_POSITION                         0x0
#define _PSMC3DCL_PSMC3DC0_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC0_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC0_MASK                             0x1
#define _PSMC3DCL_PSMC3DC1_POSN                             0x1
#define _PSMC3DCL_PSMC3DC1_POSITION                         0x1
#define _PSMC3DCL_PSMC3DC1_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC1_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC1_MASK                             0x2
#define _PSMC3DCL_PSMC3DC2_POSN                             0x2
#define _PSMC3DCL_PSMC3DC2_POSITION                         0x2
#define _PSMC3DCL_PSMC3DC2_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC2_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC2_MASK                             0x4
#define _PSMC3DCL_PSMC3DC3_POSN                             0x3
#define _PSMC3DCL_PSMC3DC3_POSITION                         0x3
#define _PSMC3DCL_PSMC3DC3_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC3_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC3_MASK                             0x8
#define _PSMC3DCL_PSMC3DC4_POSN                             0x4
#define _PSMC3DCL_PSMC3DC4_POSITION                         0x4
#define _PSMC3DCL_PSMC3DC4_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC4_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC4_MASK                             0x10
#define _PSMC3DCL_PSMC3DC5_POSN                             0x5
#define _PSMC3DCL_PSMC3DC5_POSITION                         0x5
#define _PSMC3DCL_PSMC3DC5_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC5_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC5_MASK                             0x20
#define _PSMC3DCL_PSMC3DC6_POSN                             0x6
#define _PSMC3DCL_PSMC3DC6_POSITION                         0x6
#define _PSMC3DCL_PSMC3DC6_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC6_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC6_MASK                             0x40
#define _PSMC3DCL_PSMC3DC7_POSN                             0x7
#define _PSMC3DCL_PSMC3DC7_POSITION                         0x7
#define _PSMC3DCL_PSMC3DC7_SIZE                             0x1
#define _PSMC3DCL_PSMC3DC7_LENGTH                           0x1
#define _PSMC3DCL_PSMC3DC7_MASK                             0x80

