MikroElektronika/core_packages/PIC/XC8/def/PIC16F1786/mcu.h
// Register: PSMC3DCH
#define PSMC3DCH PSMC3DCH
extern volatile unsigned char           PSMC3DCH            __at(0x864);
#ifndef _LIB_BUILD
asm("PSMC3DCH equ 0864h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3DC8               :1;
        unsigned PSMC3DC9               :1;
        unsigned PSMC3DC10              :1;
        unsigned PSMC3DC11              :1;
        unsigned PSMC3DC12              :1;
        unsigned PSMC3DC13              :1;
        unsigned PSMC3DC14              :1;
        unsigned PSMC3DC15              :1;
    };
} PSMC3DCHbits_t;
extern volatile PSMC3DCHbits_t PSMC3DCHbits __at(0x864);
// bitfield macros
#define _PSMC3DCH_PSMC3DC8_POSN                             0x0
#define _PSMC3DCH_PSMC3DC8_POSITION                         0x0
#define _PSMC3DCH_PSMC3DC8_SIZE                             0x1
#define _PSMC3DCH_PSMC3DC8_LENGTH                           0x1
#define _PSMC3DCH_PSMC3DC8_MASK                             0x1
#define _PSMC3DCH_PSMC3DC9_POSN                             0x1
#define _PSMC3DCH_PSMC3DC9_POSITION                         0x1
#define _PSMC3DCH_PSMC3DC9_SIZE                             0x1
#define _PSMC3DCH_PSMC3DC9_LENGTH                           0x1
#define _PSMC3DCH_PSMC3DC9_MASK                             0x2
#define _PSMC3DCH_PSMC3DC10_POSN                            0x2
#define _PSMC3DCH_PSMC3DC10_POSITION                        0x2
#define _PSMC3DCH_PSMC3DC10_SIZE                            0x1
#define _PSMC3DCH_PSMC3DC10_LENGTH                          0x1
#define _PSMC3DCH_PSMC3DC10_MASK                            0x4
#define _PSMC3DCH_PSMC3DC11_POSN                            0x3
#define _PSMC3DCH_PSMC3DC11_POSITION                        0x3
#define _PSMC3DCH_PSMC3DC11_SIZE                            0x1
#define _PSMC3DCH_PSMC3DC11_LENGTH                          0x1
#define _PSMC3DCH_PSMC3DC11_MASK                            0x8
#define _PSMC3DCH_PSMC3DC12_POSN                            0x4
#define _PSMC3DCH_PSMC3DC12_POSITION                        0x4
#define _PSMC3DCH_PSMC3DC12_SIZE                            0x1
#define _PSMC3DCH_PSMC3DC12_LENGTH                          0x1
#define _PSMC3DCH_PSMC3DC12_MASK                            0x10
#define _PSMC3DCH_PSMC3DC13_POSN                            0x5
#define _PSMC3DCH_PSMC3DC13_POSITION                        0x5
#define _PSMC3DCH_PSMC3DC13_SIZE                            0x1
#define _PSMC3DCH_PSMC3DC13_LENGTH                          0x1
#define _PSMC3DCH_PSMC3DC13_MASK                            0x20
#define _PSMC3DCH_PSMC3DC14_POSN                            0x6
#define _PSMC3DCH_PSMC3DC14_POSITION                        0x6
#define _PSMC3DCH_PSMC3DC14_SIZE                            0x1
#define _PSMC3DCH_PSMC3DC14_LENGTH                          0x1
#define _PSMC3DCH_PSMC3DC14_MASK                            0x40
#define _PSMC3DCH_PSMC3DC15_POSN                            0x7
#define _PSMC3DCH_PSMC3DC15_POSITION                        0x7
#define _PSMC3DCH_PSMC3DC15_SIZE                            0x1
#define _PSMC3DCH_PSMC3DC15_LENGTH                          0x1
#define _PSMC3DCH_PSMC3DC15_MASK                            0x80

// Register: PSMC3PR
#define PSMC3PR PSMC3PR
extern volatile unsigned short          PSMC3PR             __at(0x865);
#ifndef _LIB_BUILD
asm("PSMC3PR equ 0865h");
#endif

// Register: PSMC3PRL
#define PSMC3PRL PSMC3PRL
extern volatile unsigned char           PSMC3PRL            __at(0x865);
#ifndef _LIB_BUILD
asm("PSMC3PRL equ 0865h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3PR0               :1;
        unsigned PSMC3PR1               :1;
        unsigned PSMC3PR2               :1;
        unsigned PSMC3PR3               :1;
        unsigned PSMC3PR4               :1;
        unsigned PSMC3PR5               :1;
        unsigned PSMC3PR6               :1;
        unsigned PSMC3PR7               :1;
    };
} PSMC3PRLbits_t;
extern volatile PSMC3PRLbits_t PSMC3PRLbits __at(0x865);
// bitfield macros
#define _PSMC3PRL_PSMC3PR0_POSN                             0x0
#define _PSMC3PRL_PSMC3PR0_POSITION                         0x0
#define _PSMC3PRL_PSMC3PR0_SIZE                             0x1
#define _PSMC3PRL_PSMC3PR0_LENGTH                           0x1
#define _PSMC3PRL_PSMC3PR0_MASK                             0x1
#define _PSMC3PRL_PSMC3PR1_POSN                             0x1
#define _PSMC3PRL_PSMC3PR1_POSITION                         0x1
#define _PSMC3PRL_PSMC3PR1_SIZE                             0x1
#define _PSMC3PRL_PSMC3PR1_LENGTH                           0x1
#define _PSMC3PRL_PSMC3PR1_MASK                             0x2
#define _PSMC3PRL_PSMC3PR2_POSN                             0x2
#define _PSMC3PRL_PSMC3PR2_POSITION                         0x2
#define _PSMC3PRL_PSMC3PR2_SIZE                             0x1
#define _PSMC3PRL_PSMC3PR2_LENGTH                           0x1
#define _PSMC3PRL_PSMC3PR2_MASK                             0x4
#define _PSMC3PRL_PSMC3PR3_POSN                             0x3
#define _PSMC3PRL_PSMC3PR3_POSITION                         0x3
#define _PSMC3PRL_PSMC3PR3_SIZE                             0x1
#define _PSMC3PRL_PSMC3PR3_LENGTH                           0x1
#define _PSMC3PRL_PSMC3PR3_MASK                             0x8
#define _PSMC3PRL_PSMC3PR4_POSN                             0x4
#define _PSMC3PRL_PSMC3PR4_POSITION                         0x4
#define _PSMC3PRL_PSMC3PR4_SIZE                             0x1
#define _PSMC3PRL_PSMC3PR4_LENGTH                           0x1
#define _PSMC3PRL_PSMC3PR4_MASK                             0x10
#define _PSMC3PRL_PSMC3PR5_POSN                             0x5
#define _PSMC3PRL_PSMC3PR5_POSITION                         0x5
#define _PSMC3PRL_PSMC3PR5_SIZE                             0x1
#define _PSMC3PRL_PSMC3PR5_LENGTH                           0x1
#define _PSMC3PRL_PSMC3PR5_MASK                             0x20
#define _PSMC3PRL_PSMC3PR6_POSN                             0x6
#define _PSMC3PRL_PSMC3PR6_POSITION                         0x6
#define _PSMC3PRL_PSMC3PR6_SIZE                             0x1
#define _PSMC3PRL_PSMC3PR6_LENGTH                           0x1
#define _PSMC3PRL_PSMC3PR6_MASK                             0x40
#define _PSMC3PRL_PSMC3PR7_POSN                             0x7
#define _PSMC3PRL_PSMC3PR7_POSITION                         0x7
#define _PSMC3PRL_PSMC3PR7_SIZE                             0x1
#define _PSMC3PRL_PSMC3PR7_LENGTH                           0x1
#define _PSMC3PRL_PSMC3PR7_MASK                             0x80

