MikroElektronika/core_packages/PIC/XC8/def/PIC16F1786/mcu.h
extern volatile PSMC3TMRHbits_t PSMC3TMRHbits __at(0x868);
// bitfield macros
#define _PSMC3TMRH_PSMC3TMR8_POSN                           0x0
#define _PSMC3TMRH_PSMC3TMR8_POSITION                       0x0
#define _PSMC3TMRH_PSMC3TMR8_SIZE                           0x1
#define _PSMC3TMRH_PSMC3TMR8_LENGTH                         0x1
#define _PSMC3TMRH_PSMC3TMR8_MASK                           0x1
#define _PSMC3TMRH_PSMC3TMR9_POSN                           0x1
#define _PSMC3TMRH_PSMC3TMR9_POSITION                       0x1
#define _PSMC3TMRH_PSMC3TMR9_SIZE                           0x1
#define _PSMC3TMRH_PSMC3TMR9_LENGTH                         0x1
#define _PSMC3TMRH_PSMC3TMR9_MASK                           0x2
#define _PSMC3TMRH_PSMC3TMR10_POSN                          0x2
#define _PSMC3TMRH_PSMC3TMR10_POSITION                      0x2
#define _PSMC3TMRH_PSMC3TMR10_SIZE                          0x1
#define _PSMC3TMRH_PSMC3TMR10_LENGTH                        0x1
#define _PSMC3TMRH_PSMC3TMR10_MASK                          0x4
#define _PSMC3TMRH_PSMC3TMR11_POSN                          0x3
#define _PSMC3TMRH_PSMC3TMR11_POSITION                      0x3
#define _PSMC3TMRH_PSMC3TMR11_SIZE                          0x1
#define _PSMC3TMRH_PSMC3TMR11_LENGTH                        0x1
#define _PSMC3TMRH_PSMC3TMR11_MASK                          0x8
#define _PSMC3TMRH_PSMC3TMR12_POSN                          0x4
#define _PSMC3TMRH_PSMC3TMR12_POSITION                      0x4
#define _PSMC3TMRH_PSMC3TMR12_SIZE                          0x1
#define _PSMC3TMRH_PSMC3TMR12_LENGTH                        0x1
#define _PSMC3TMRH_PSMC3TMR12_MASK                          0x10
#define _PSMC3TMRH_PSMC3TMR13_POSN                          0x5
#define _PSMC3TMRH_PSMC3TMR13_POSITION                      0x5
#define _PSMC3TMRH_PSMC3TMR13_SIZE                          0x1
#define _PSMC3TMRH_PSMC3TMR13_LENGTH                        0x1
#define _PSMC3TMRH_PSMC3TMR13_MASK                          0x20
#define _PSMC3TMRH_PSMC3TMR14_POSN                          0x6
#define _PSMC3TMRH_PSMC3TMR14_POSITION                      0x6
#define _PSMC3TMRH_PSMC3TMR14_SIZE                          0x1
#define _PSMC3TMRH_PSMC3TMR14_LENGTH                        0x1
#define _PSMC3TMRH_PSMC3TMR14_MASK                          0x40
#define _PSMC3TMRH_PSMC3TMR15_POSN                          0x7
#define _PSMC3TMRH_PSMC3TMR15_POSITION                      0x7
#define _PSMC3TMRH_PSMC3TMR15_SIZE                          0x1
#define _PSMC3TMRH_PSMC3TMR15_LENGTH                        0x1
#define _PSMC3TMRH_PSMC3TMR15_MASK                          0x80

// Register: PSMC3DBR
#define PSMC3DBR PSMC3DBR
extern volatile unsigned char           PSMC3DBR            __at(0x869);
#ifndef _LIB_BUILD
asm("PSMC3DBR equ 0869h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3DBR0              :1;
        unsigned PSMC3DBR1              :1;
        unsigned PSMC3DBR2              :1;
        unsigned PSMC3DBR3              :1;
        unsigned PSMC3DBR4              :1;
        unsigned PSMC3DBR5              :1;
        unsigned PSMC3DBR6              :1;
        unsigned PSMC3DBR7              :1;
    };
} PSMC3DBRbits_t;
extern volatile PSMC3DBRbits_t PSMC3DBRbits __at(0x869);
// bitfield macros
#define _PSMC3DBR_PSMC3DBR0_POSN                            0x0
#define _PSMC3DBR_PSMC3DBR0_POSITION                        0x0
#define _PSMC3DBR_PSMC3DBR0_SIZE                            0x1
#define _PSMC3DBR_PSMC3DBR0_LENGTH                          0x1
#define _PSMC3DBR_PSMC3DBR0_MASK                            0x1
#define _PSMC3DBR_PSMC3DBR1_POSN                            0x1
#define _PSMC3DBR_PSMC3DBR1_POSITION                        0x1
#define _PSMC3DBR_PSMC3DBR1_SIZE                            0x1
#define _PSMC3DBR_PSMC3DBR1_LENGTH                          0x1
#define _PSMC3DBR_PSMC3DBR1_MASK                            0x2
#define _PSMC3DBR_PSMC3DBR2_POSN                            0x2
#define _PSMC3DBR_PSMC3DBR2_POSITION                        0x2
#define _PSMC3DBR_PSMC3DBR2_SIZE                            0x1
#define _PSMC3DBR_PSMC3DBR2_LENGTH                          0x1
#define _PSMC3DBR_PSMC3DBR2_MASK                            0x4
#define _PSMC3DBR_PSMC3DBR3_POSN                            0x3
#define _PSMC3DBR_PSMC3DBR3_POSITION                        0x3
#define _PSMC3DBR_PSMC3DBR3_SIZE                            0x1
#define _PSMC3DBR_PSMC3DBR3_LENGTH                          0x1
#define _PSMC3DBR_PSMC3DBR3_MASK                            0x8
#define _PSMC3DBR_PSMC3DBR4_POSN                            0x4
#define _PSMC3DBR_PSMC3DBR4_POSITION                        0x4
#define _PSMC3DBR_PSMC3DBR4_SIZE                            0x1
#define _PSMC3DBR_PSMC3DBR4_LENGTH                          0x1
#define _PSMC3DBR_PSMC3DBR4_MASK                            0x10
#define _PSMC3DBR_PSMC3DBR5_POSN                            0x5
#define _PSMC3DBR_PSMC3DBR5_POSITION                        0x5
#define _PSMC3DBR_PSMC3DBR5_SIZE                            0x1
#define _PSMC3DBR_PSMC3DBR5_LENGTH                          0x1
#define _PSMC3DBR_PSMC3DBR5_MASK                            0x20
#define _PSMC3DBR_PSMC3DBR6_POSN                            0x6
#define _PSMC3DBR_PSMC3DBR6_POSITION                        0x6
#define _PSMC3DBR_PSMC3DBR6_SIZE                            0x1
#define _PSMC3DBR_PSMC3DBR6_LENGTH                          0x1
#define _PSMC3DBR_PSMC3DBR6_MASK                            0x40
#define _PSMC3DBR_PSMC3DBR7_POSN                            0x7
#define _PSMC3DBR_PSMC3DBR7_POSITION                        0x7
#define _PSMC3DBR_PSMC3DBR7_SIZE                            0x1
#define _PSMC3DBR_PSMC3DBR7_LENGTH                          0x1
#define _PSMC3DBR_PSMC3DBR7_MASK                            0x80

// Register: PSMC3DBF
#define PSMC3DBF PSMC3DBF
extern volatile unsigned char           PSMC3DBF            __at(0x86A);
#ifndef _LIB_BUILD
asm("PSMC3DBF equ 086Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3DBF0              :1;
        unsigned PSMC3DBF1              :1;
        unsigned PSMC3DBF2              :1;
        unsigned PSMC3DBF3              :1;
        unsigned PSMC3DBF4              :1;
        unsigned PSMC3DBF5              :1;
        unsigned PSMC3DBF6              :1;
        unsigned PSMC3DBF7              :1;
    };
} PSMC3DBFbits_t;
extern volatile PSMC3DBFbits_t PSMC3DBFbits __at(0x86A);
// bitfield macros
#define _PSMC3DBF_PSMC3DBF0_POSN                            0x0
#define _PSMC3DBF_PSMC3DBF0_POSITION                        0x0
#define _PSMC3DBF_PSMC3DBF0_SIZE                            0x1
#define _PSMC3DBF_PSMC3DBF0_LENGTH                          0x1
#define _PSMC3DBF_PSMC3DBF0_MASK                            0x1
#define _PSMC3DBF_PSMC3DBF1_POSN                            0x1
#define _PSMC3DBF_PSMC3DBF1_POSITION                        0x1
#define _PSMC3DBF_PSMC3DBF1_SIZE                            0x1
#define _PSMC3DBF_PSMC3DBF1_LENGTH                          0x1
#define _PSMC3DBF_PSMC3DBF1_MASK                            0x2
#define _PSMC3DBF_PSMC3DBF2_POSN                            0x2
#define _PSMC3DBF_PSMC3DBF2_POSITION                        0x2
#define _PSMC3DBF_PSMC3DBF2_SIZE                            0x1
#define _PSMC3DBF_PSMC3DBF2_LENGTH                          0x1
#define _PSMC3DBF_PSMC3DBF2_MASK                            0x4
#define _PSMC3DBF_PSMC3DBF3_POSN                            0x3
#define _PSMC3DBF_PSMC3DBF3_POSITION                        0x3
#define _PSMC3DBF_PSMC3DBF3_SIZE                            0x1
#define _PSMC3DBF_PSMC3DBF3_LENGTH                          0x1
#define _PSMC3DBF_PSMC3DBF3_MASK                            0x8
#define _PSMC3DBF_PSMC3DBF4_POSN                            0x4
#define _PSMC3DBF_PSMC3DBF4_POSITION                        0x4
#define _PSMC3DBF_PSMC3DBF4_SIZE                            0x1
#define _PSMC3DBF_PSMC3DBF4_LENGTH                          0x1
#define _PSMC3DBF_PSMC3DBF4_MASK                            0x10
#define _PSMC3DBF_PSMC3DBF5_POSN                            0x5
#define _PSMC3DBF_PSMC3DBF5_POSITION                        0x5
#define _PSMC3DBF_PSMC3DBF5_SIZE                            0x1
#define _PSMC3DBF_PSMC3DBF5_LENGTH                          0x1
#define _PSMC3DBF_PSMC3DBF5_MASK                            0x20
#define _PSMC3DBF_PSMC3DBF6_POSN                            0x6
#define _PSMC3DBF_PSMC3DBF6_POSITION                        0x6
#define _PSMC3DBF_PSMC3DBF6_SIZE                            0x1
#define _PSMC3DBF_PSMC3DBF6_LENGTH                          0x1
#define _PSMC3DBF_PSMC3DBF6_MASK                            0x40
#define _PSMC3DBF_PSMC3DBF7_POSN                            0x7
#define _PSMC3DBF_PSMC3DBF7_POSITION                        0x7
#define _PSMC3DBF_PSMC3DBF7_SIZE                            0x1
#define _PSMC3DBF_PSMC3DBF7_LENGTH                          0x1
#define _PSMC3DBF_PSMC3DBF7_MASK                            0x80

// Register: PSMC3BLKR
#define PSMC3BLKR PSMC3BLKR
extern volatile unsigned char           PSMC3BLKR           __at(0x86B);
#ifndef _LIB_BUILD
asm("PSMC3BLKR equ 086Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3BLKR0             :1;
        unsigned PSMC3BLKR1             :1;
        unsigned PSMC3BLKR2             :1;
        unsigned PSMC3BLKR3             :1;
        unsigned PSMC3BLKR4             :1;
        unsigned PSMC3BLKR5             :1;
        unsigned PSMC3BLKR6             :1;
        unsigned PSMC3BLKR7             :1;
    };
} PSMC3BLKRbits_t;
extern volatile PSMC3BLKRbits_t PSMC3BLKRbits __at(0x86B);
// bitfield macros
#define _PSMC3BLKR_PSMC3BLKR0_POSN                          0x0
#define _PSMC3BLKR_PSMC3BLKR0_POSITION                      0x0
#define _PSMC3BLKR_PSMC3BLKR0_SIZE                          0x1
#define _PSMC3BLKR_PSMC3BLKR0_LENGTH                        0x1
#define _PSMC3BLKR_PSMC3BLKR0_MASK                          0x1
#define _PSMC3BLKR_PSMC3BLKR1_POSN                          0x1
#define _PSMC3BLKR_PSMC3BLKR1_POSITION                      0x1
#define _PSMC3BLKR_PSMC3BLKR1_SIZE                          0x1
#define _PSMC3BLKR_PSMC3BLKR1_LENGTH                        0x1
#define _PSMC3BLKR_PSMC3BLKR1_MASK                          0x2
#define _PSMC3BLKR_PSMC3BLKR2_POSN                          0x2
#define _PSMC3BLKR_PSMC3BLKR2_POSITION                      0x2
#define _PSMC3BLKR_PSMC3BLKR2_SIZE                          0x1
#define _PSMC3BLKR_PSMC3BLKR2_LENGTH                        0x1
#define _PSMC3BLKR_PSMC3BLKR2_MASK                          0x4
#define _PSMC3BLKR_PSMC3BLKR3_POSN                          0x3
#define _PSMC3BLKR_PSMC3BLKR3_POSITION                      0x3
#define _PSMC3BLKR_PSMC3BLKR3_SIZE                          0x1
#define _PSMC3BLKR_PSMC3BLKR3_LENGTH                        0x1
#define _PSMC3BLKR_PSMC3BLKR3_MASK                          0x8
#define _PSMC3BLKR_PSMC3BLKR4_POSN                          0x4
#define _PSMC3BLKR_PSMC3BLKR4_POSITION                      0x4
#define _PSMC3BLKR_PSMC3BLKR4_SIZE                          0x1
#define _PSMC3BLKR_PSMC3BLKR4_LENGTH                        0x1
#define _PSMC3BLKR_PSMC3BLKR4_MASK                          0x10
#define _PSMC3BLKR_PSMC3BLKR5_POSN                          0x5
#define _PSMC3BLKR_PSMC3BLKR5_POSITION                      0x5
#define _PSMC3BLKR_PSMC3BLKR5_SIZE                          0x1
#define _PSMC3BLKR_PSMC3BLKR5_LENGTH                        0x1
#define _PSMC3BLKR_PSMC3BLKR5_MASK                          0x20
#define _PSMC3BLKR_PSMC3BLKR6_POSN                          0x6
#define _PSMC3BLKR_PSMC3BLKR6_POSITION                      0x6
#define _PSMC3BLKR_PSMC3BLKR6_SIZE                          0x1
#define _PSMC3BLKR_PSMC3BLKR6_LENGTH                        0x1
#define _PSMC3BLKR_PSMC3BLKR6_MASK                          0x40
#define _PSMC3BLKR_PSMC3BLKR7_POSN                          0x7
#define _PSMC3BLKR_PSMC3BLKR7_POSITION                      0x7
#define _PSMC3BLKR_PSMC3BLKR7_SIZE                          0x1
#define _PSMC3BLKR_PSMC3BLKR7_LENGTH                        0x1
#define _PSMC3BLKR_PSMC3BLKR7_MASK                          0x80

