MikroElektronika/core_packages/PIC/XC8/def/PIC16F1786/mcu.h
extern volatile __bit                   MC3OUT              __at(0x8AA);	// @ (0x115 * 8 + 2)
#define                                 MC3OUT_bit          _BIT_ACCESS(CMOUT,2)
// CMOUT<MC4OUT>
extern volatile __bit                   MC4OUT              __at(0x8AB);	// @ (0x115 * 8 + 3)
#define                                 MC4OUT_bit          _BIT_ACCESS(CMOUT,3)
// OSCSTAT<MFIOFR>
extern volatile __bit                   MFIOFR              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 MFIOFR_bit          _BIT_ACCESS(OSCSTAT,2)
// SSP1MSK<MSK0>
extern volatile __bit                   MSK0                __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 MSK0_bit            _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<MSK1>
extern volatile __bit                   MSK1                __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 MSK1_bit            _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<MSK2>
extern volatile __bit                   MSK2                __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 MSK2_bit            _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<MSK3>
extern volatile __bit                   MSK3                __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 MSK3_bit            _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<MSK4>
extern volatile __bit                   MSK4                __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 MSK4_bit            _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<MSK5>
extern volatile __bit                   MSK5                __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 MSK5_bit            _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<MSK6>
extern volatile __bit                   MSK6                __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 MSK6_bit            _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<MSK7>
extern volatile __bit                   MSK7                __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 MSK7_bit            _BIT_ACCESS(SSP1MSK,7)
// ODCONA<ODCONA0>
extern volatile __bit                   ODCONA0             __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODCONA0_bit         _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCONA1>
extern volatile __bit                   ODCONA1             __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODCONA1_bit         _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCONA2>
extern volatile __bit                   ODCONA2             __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODCONA2_bit         _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCONA3>
extern volatile __bit                   ODCONA3             __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 ODCONA3_bit         _BIT_ACCESS(ODCONA,3)
// ODCONA<ODCONA4>
extern volatile __bit                   ODCONA4             __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODCONA4_bit         _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCONA5>
extern volatile __bit                   ODCONA5             __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODCONA5_bit         _BIT_ACCESS(ODCONA,5)
// ODCONA<ODCONA6>
extern volatile __bit                   ODCONA6             __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 ODCONA6_bit         _BIT_ACCESS(ODCONA,6)
// ODCONA<ODCONA7>
extern volatile __bit                   ODCONA7             __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 ODCONA7_bit         _BIT_ACCESS(ODCONA,7)
// ODCONB<ODCONB0>
extern volatile __bit                   ODCONB0             __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 ODCONB0_bit         _BIT_ACCESS(ODCONB,0)
// ODCONB<ODCONB1>
extern volatile __bit                   ODCONB1             __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 ODCONB1_bit         _BIT_ACCESS(ODCONB,1)
// ODCONB<ODCONB2>
extern volatile __bit                   ODCONB2             __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 ODCONB2_bit         _BIT_ACCESS(ODCONB,2)
// ODCONB<ODCONB3>
extern volatile __bit                   ODCONB3             __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 ODCONB3_bit         _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCONB4>
extern volatile __bit                   ODCONB4             __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 ODCONB4_bit         _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCONB5>
extern volatile __bit                   ODCONB5             __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 ODCONB5_bit         _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCONB6>
extern volatile __bit                   ODCONB6             __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 ODCONB6_bit         _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCONB7>
extern volatile __bit                   ODCONB7             __at(0x146F);	// @ (0x28D * 8 + 7)
#define                                 ODCONB7_bit         _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCONC0>
extern volatile __bit                   ODCONC0             __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODCONC0_bit         _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCONC1>
extern volatile __bit                   ODCONC1             __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODCONC1_bit         _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCONC2>
extern volatile __bit                   ODCONC2             __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODCONC2_bit         _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCONC3>
extern volatile __bit                   ODCONC3             __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODCONC3_bit         _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCONC4>
extern volatile __bit                   ODCONC4             __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODCONC4_bit         _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCONC5>
extern volatile __bit                   ODCONC5             __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODCONC5_bit         _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCONC6>
extern volatile __bit                   ODCONC6             __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 ODCONC6_bit         _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCONC7>
extern volatile __bit                   ODCONC7             __at(0x1477);	// @ (0x28E * 8 + 7)
#define                                 ODCONC7_bit         _BIT_ACCESS(ODCONC,7)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// OPA1CON<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x288F);	// @ (0x511 * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON,7)
// OPA1CON<OPA1PCH0>
extern volatile __bit                   OPA1PCH0            __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 OPA1PCH0_bit        _BIT_ACCESS(OPA1CON,0)
// OPA1CON<OPA1PCH1>
extern volatile __bit                   OPA1PCH1            __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 OPA1PCH1_bit        _BIT_ACCESS(OPA1CON,1)
// OPA1CON<OPA1SP>
extern volatile __bit                   OPA1SP              __at(0x288E);	// @ (0x511 * 8 + 6)
#define                                 OPA1SP_bit          _BIT_ACCESS(OPA1CON,6)
// OPA2CON<OPA2EN>
extern volatile __bit                   OPA2EN              __at(0x289F);	// @ (0x513 * 8 + 7)
#define                                 OPA2EN_bit          _BIT_ACCESS(OPA2CON,7)
// OPA2CON<OPA2PCH0>
extern volatile __bit                   OPA2PCH0            __at(0x2898);	// @ (0x513 * 8 + 0)
#define                                 OPA2PCH0_bit        _BIT_ACCESS(OPA2CON,0)
// OPA2CON<OPA2PCH1>
extern volatile __bit                   OPA2PCH1            __at(0x2899);	// @ (0x513 * 8 + 1)
#define                                 OPA2PCH1_bit        _BIT_ACCESS(OPA2CON,1)
// OPA2CON<OPA2SP>
extern volatile __bit                   OPA2SP              __at(0x289E);	// @ (0x513 * 8 + 6)
#define                                 OPA2SP_bit          _BIT_ACCESS(OPA2CON,6)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x97);	// @ (0x12 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// PSMC1ASDC<P1ARSEN>
extern volatile __bit                   P1ARSEN             __at(0x40ED);	// @ (0x81D * 8 + 5)
#define                                 P1ARSEN_bit         _BIT_ACCESS(PSMC1ASDC,5)
// PSMC1ASDC<P1ASDEN>
extern volatile __bit                   P1ASDEN             __at(0x40EE);	// @ (0x81D * 8 + 6)
#define                                 P1ASDEN_bit         _BIT_ACCESS(PSMC1ASDC,6)
// PSMC1ASDL<P1ASDLA>
extern volatile __bit                   P1ASDLA             __at(0x40F0);	// @ (0x81E * 8 + 0)
#define                                 P1ASDLA_bit         _BIT_ACCESS(PSMC1ASDL,0)
// PSMC1ASDL<P1ASDLB>
extern volatile __bit                   P1ASDLB             __at(0x40F1);	// @ (0x81E * 8 + 1)
#define                                 P1ASDLB_bit         _BIT_ACCESS(PSMC1ASDL,1)
// PSMC1ASDL<P1ASDLC>
extern volatile __bit                   P1ASDLC             __at(0x40F2);	// @ (0x81E * 8 + 2)
#define                                 P1ASDLC_bit         _BIT_ACCESS(PSMC1ASDL,2)
// PSMC1ASDL<P1ASDLD>
extern volatile __bit                   P1ASDLD             __at(0x40F3);	// @ (0x81E * 8 + 3)
#define                                 P1ASDLD_bit         _BIT_ACCESS(PSMC1ASDL,3)
// PSMC1ASDL<P1ASDLE>
extern volatile __bit                   P1ASDLE             __at(0x40F4);	// @ (0x81E * 8 + 4)
#define                                 P1ASDLE_bit         _BIT_ACCESS(PSMC1ASDL,4)
// PSMC1ASDL<P1ASDLF>
extern volatile __bit                   P1ASDLF             __at(0x40F5);	// @ (0x81E * 8 + 5)
#define                                 P1ASDLF_bit         _BIT_ACCESS(PSMC1ASDL,5)
// PSMC1ASDC<P1ASDOV>
extern volatile __bit                   P1ASDOV             __at(0x40E8);	// @ (0x81D * 8 + 0)
#define                                 P1ASDOV_bit         _BIT_ACCESS(PSMC1ASDC,0)
// PSMC1ASDS<P1ASDSC1>
extern volatile __bit                   P1ASDSC1            __at(0x40F9);	// @ (0x81F * 8 + 1)
#define                                 P1ASDSC1_bit        _BIT_ACCESS(PSMC1ASDS,1)
// PSMC1ASDS<P1ASDSC2>
extern volatile __bit                   P1ASDSC2            __at(0x40FA);	// @ (0x81F * 8 + 2)
#define                                 P1ASDSC2_bit        _BIT_ACCESS(PSMC1ASDS,2)
// PSMC1ASDS<P1ASDSC3>
extern volatile __bit                   P1ASDSC3            __at(0x40FB);	// @ (0x81F * 8 + 3)
#define                                 P1ASDSC3_bit        _BIT_ACCESS(PSMC1ASDS,3)
// PSMC1ASDS<P1ASDSC4>
extern volatile __bit                   P1ASDSC4            __at(0x40FC);	// @ (0x81F * 8 + 4)
#define                                 P1ASDSC4_bit        _BIT_ACCESS(PSMC1ASDS,4)
// PSMC1ASDS<P1ASDSIN>
extern volatile __bit                   P1ASDSIN            __at(0x40FF);	// @ (0x81F * 8 + 7)
#define                                 P1ASDSIN_bit        _BIT_ACCESS(PSMC1ASDS,7)
// PSMC1ASDC<P1ASE>
extern volatile __bit                   P1ASE               __at(0x40EF);	// @ (0x81D * 8 + 7)
#define                                 P1ASE_bit           _BIT_ACCESS(PSMC1ASDC,7)
// PSMC1CLK<P1CPRE0>
extern volatile __bit                   P1CPRE0             __at(0x40A4);	// @ (0x814 * 8 + 4)
#define                                 P1CPRE0_bit         _BIT_ACCESS(PSMC1CLK,4)
// PSMC1CLK<P1CPRE1>
extern volatile __bit                   P1CPRE1             __at(0x40A5);	// @ (0x814 * 8 + 5)
#define                                 P1CPRE1_bit         _BIT_ACCESS(PSMC1CLK,5)
// PSMC1CLK<P1CSRC0>
extern volatile __bit                   P1CSRC0             __at(0x40A0);	// @ (0x814 * 8 + 0)
#define                                 P1CSRC0_bit         _BIT_ACCESS(PSMC1CLK,0)
// PSMC1CLK<P1CSRC1>
extern volatile __bit                   P1CSRC1             __at(0x40A1);	// @ (0x814 * 8 + 1)
#define                                 P1CSRC1_bit         _BIT_ACCESS(PSMC1CLK,1)
// PSMC1CON<P1DBFE>
extern volatile __bit                   P1DBFE              __at(0x408D);	// @ (0x811 * 8 + 5)
#define                                 P1DBFE_bit          _BIT_ACCESS(PSMC1CON,5)
// PSMC1CON<P1DBRE>
extern volatile __bit                   P1DBRE              __at(0x408C);	// @ (0x811 * 8 + 4)
#define                                 P1DBRE_bit          _BIT_ACCESS(PSMC1CON,4)
// PSMC1SYNC<P1DCPOL>
extern volatile __bit                   P1DCPOL             __at(0x409D);	// @ (0x813 * 8 + 5)
#define                                 P1DCPOL_bit         _BIT_ACCESS(PSMC1SYNC,5)
// PSMC1DCS<P1DCSC1>
extern volatile __bit                   P1DCSC1             __at(0x40D9);	// @ (0x81B * 8 + 1)
#define                                 P1DCSC1_bit         _BIT_ACCESS(PSMC1DCS,1)
// PSMC1DCS<P1DCSC2>
extern volatile __bit                   P1DCSC2             __at(0x40DA);	// @ (0x81B * 8 + 2)
#define                                 P1DCSC2_bit         _BIT_ACCESS(PSMC1DCS,2)
// PSMC1DCS<P1DCSC3>
extern volatile __bit                   P1DCSC3             __at(0x40DB);	// @ (0x81B * 8 + 3)
#define                                 P1DCSC3_bit         _BIT_ACCESS(PSMC1DCS,3)
// PSMC1DCS<P1DCSC4>
extern volatile __bit                   P1DCSC4             __at(0x40DC);	// @ (0x81B * 8 + 4)
#define                                 P1DCSC4_bit         _BIT_ACCESS(PSMC1DCS,4)
// PSMC1DCS<P1DCSIN>
extern volatile __bit                   P1DCSIN             __at(0x40DF);	// @ (0x81B * 8 + 7)
#define                                 P1DCSIN_bit         _BIT_ACCESS(PSMC1DCS,7)
// PSMC1DCS<P1DCST>
extern volatile __bit                   P1DCST              __at(0x40D8);	// @ (0x81B * 8 + 0)
#define                                 P1DCST_bit          _BIT_ACCESS(PSMC1DCS,0)
// PSMC1BLNK<P1FEBM0>
extern volatile __bit                   P1FEBM0             __at(0x40BC);	// @ (0x817 * 8 + 4)
#define                                 P1FEBM0_bit         _BIT_ACCESS(PSMC1BLNK,4)
// PSMC1BLNK<P1FEBM1>
extern volatile __bit                   P1FEBM1             __at(0x40BD);	// @ (0x817 * 8 + 5)
#define                                 P1FEBM1_bit         _BIT_ACCESS(PSMC1BLNK,5)
// PSMC1FEBS<P1FEBSC1>
extern volatile __bit                   P1FEBSC1            __at(0x40C9);	// @ (0x819 * 8 + 1)
#define                                 P1FEBSC1_bit        _BIT_ACCESS(PSMC1FEBS,1)
// PSMC1FEBS<P1FEBSC2>
extern volatile __bit                   P1FEBSC2            __at(0x40CA);	// @ (0x819 * 8 + 2)
#define                                 P1FEBSC2_bit        _BIT_ACCESS(PSMC1FEBS,2)
// PSMC1FEBS<P1FEBSC3>
extern volatile __bit                   P1FEBSC3            __at(0x40CB);	// @ (0x819 * 8 + 3)
#define                                 P1FEBSC3_bit        _BIT_ACCESS(PSMC1FEBS,3)
// PSMC1FEBS<P1FEBSC4>
extern volatile __bit                   P1FEBSC4            __at(0x40CC);	// @ (0x819 * 8 + 4)
#define                                 P1FEBSC4_bit        _BIT_ACCESS(PSMC1FEBS,4)
// PSMC1FEBS<P1FEBSIN>
extern volatile __bit                   P1FEBSIN            __at(0x40CF);	// @ (0x819 * 8 + 7)
#define                                 P1FEBSIN_bit        _BIT_ACCESS(PSMC1FEBS,7)
// PSMC1STR1<P1HSMEN>
extern volatile __bit                   P1HSMEN             __at(0x4178);	// @ (0x82F * 8 + 0)
#define                                 P1HSMEN_bit         _BIT_ACCESS(PSMC1STR1,0)
// PSMC1POL<P1INPOL>
extern volatile __bit                   P1INPOL             __at(0x40B6);	// @ (0x816 * 8 + 6)
#define                                 P1INPOL_bit         _BIT_ACCESS(PSMC1POL,6)
// PSMC1STR1<P1LSMEN>
extern volatile __bit                   P1LSMEN             __at(0x4179);	// @ (0x82F * 8 + 1)
#define                                 P1LSMEN_bit         _BIT_ACCESS(PSMC1STR1,1)
// PSMC1MDL<P1MDLBIT>
extern volatile __bit                   P1MDLBIT            __at(0x4095);	// @ (0x812 * 8 + 5)
#define                                 P1MDLBIT_bit        _BIT_ACCESS(PSMC1MDL,5)
// PSMC1MDL<P1MDLEN>
extern volatile __bit                   P1MDLEN             __at(0x4097);	// @ (0x812 * 8 + 7)
#define                                 P1MDLEN_bit         _BIT_ACCESS(PSMC1MDL,7)
// PSMC1MDL<P1MDLPOL>
extern volatile __bit                   P1MDLPOL            __at(0x4096);	// @ (0x812 * 8 + 6)
#define                                 P1MDLPOL_bit        _BIT_ACCESS(PSMC1MDL,6)
// PSMC1CON<P1MODE0>
extern volatile __bit                   P1MODE0             __at(0x4088);	// @ (0x811 * 8 + 0)
#define                                 P1MODE0_bit         _BIT_ACCESS(PSMC1CON,0)
// PSMC1CON<P1MODE1>
extern volatile __bit                   P1MODE1             __at(0x4089);	// @ (0x811 * 8 + 1)
#define                                 P1MODE1_bit         _BIT_ACCESS(PSMC1CON,1)
// PSMC1CON<P1MODE2>
extern volatile __bit                   P1MODE2             __at(0x408A);	// @ (0x811 * 8 + 2)
#define                                 P1MODE2_bit         _BIT_ACCESS(PSMC1CON,2)
// PSMC1CON<P1MODE3>
extern volatile __bit                   P1MODE3             __at(0x408B);	// @ (0x811 * 8 + 3)
#define                                 P1MODE3_bit         _BIT_ACCESS(PSMC1CON,3)
// PSMC1MDL<P1MSRC0>
extern volatile __bit                   P1MSRC0             __at(0x4090);	// @ (0x812 * 8 + 0)
#define                                 P1MSRC0_bit         _BIT_ACCESS(PSMC1MDL,0)
// PSMC1MDL<P1MSRC1>
extern volatile __bit                   P1MSRC1             __at(0x4091);	// @ (0x812 * 8 + 1)
#define                                 P1MSRC1_bit         _BIT_ACCESS(PSMC1MDL,1)
// PSMC1MDL<P1MSRC2>
extern volatile __bit                   P1MSRC2             __at(0x4092);	// @ (0x812 * 8 + 2)
#define                                 P1MSRC2_bit         _BIT_ACCESS(PSMC1MDL,2)
// PSMC1MDL<P1MSRC3>
extern volatile __bit                   P1MSRC3             __at(0x4093);	// @ (0x812 * 8 + 3)
#define                                 P1MSRC3_bit         _BIT_ACCESS(PSMC1MDL,3)
// PSMC1OEN<P1OEA>
extern volatile __bit                   P1OEA               __at(0x40A8);	// @ (0x815 * 8 + 0)
#define                                 P1OEA_bit           _BIT_ACCESS(PSMC1OEN,0)
// PSMC1OEN<P1OEB>
extern volatile __bit                   P1OEB               __at(0x40A9);	// @ (0x815 * 8 + 1)
#define                                 P1OEB_bit           _BIT_ACCESS(PSMC1OEN,1)
// PSMC1OEN<P1OEC>
extern volatile __bit                   P1OEC               __at(0x40AA);	// @ (0x815 * 8 + 2)
#define                                 P1OEC_bit           _BIT_ACCESS(PSMC1OEN,2)
// PSMC1OEN<P1OED>
extern volatile __bit                   P1OED               __at(0x40AB);	// @ (0x815 * 8 + 3)
#define                                 P1OED_bit           _BIT_ACCESS(PSMC1OEN,3)
// PSMC1OEN<P1OEE>
extern volatile __bit                   P1OEE               __at(0x40AC);	// @ (0x815 * 8 + 4)
#define                                 P1OEE_bit           _BIT_ACCESS(PSMC1OEN,4)
// PSMC1OEN<P1OEF>
extern volatile __bit                   P1OEF               __at(0x40AD);	// @ (0x815 * 8 + 5)
#define                                 P1OEF_bit           _BIT_ACCESS(PSMC1OEN,5)
// PSMC1PHS<P1PHSC1>
extern volatile __bit                   P1PHSC1             __at(0x40D1);	// @ (0x81A * 8 + 1)
#define                                 P1PHSC1_bit         _BIT_ACCESS(PSMC1PHS,1)
// PSMC1PHS<P1PHSC2>
extern volatile __bit                   P1PHSC2             __at(0x40D2);	// @ (0x81A * 8 + 2)
#define                                 P1PHSC2_bit         _BIT_ACCESS(PSMC1PHS,2)
// PSMC1PHS<P1PHSC3>
extern volatile __bit                   P1PHSC3             __at(0x40D3);	// @ (0x81A * 8 + 3)
#define                                 P1PHSC3_bit         _BIT_ACCESS(PSMC1PHS,3)
// PSMC1PHS<P1PHSC4>
extern volatile __bit                   P1PHSC4             __at(0x40D4);	// @ (0x81A * 8 + 4)
#define                                 P1PHSC4_bit         _BIT_ACCESS(PSMC1PHS,4)
// PSMC1PHS<P1PHSIN>
extern volatile __bit                   P1PHSIN             __at(0x40D7);	// @ (0x81A * 8 + 7)
#define                                 P1PHSIN_bit         _BIT_ACCESS(PSMC1PHS,7)
// PSMC1PHS<P1PHST>
extern volatile __bit                   P1PHST              __at(0x40D0);	// @ (0x81A * 8 + 0)
#define                                 P1PHST_bit          _BIT_ACCESS(PSMC1PHS,0)
// PSMC1SYNC<P1POFST>
extern volatile __bit                   P1POFST             __at(0x409F);	// @ (0x813 * 8 + 7)
#define                                 P1POFST_bit         _BIT_ACCESS(PSMC1SYNC,7)
// PSMC1POL<P1POLA>
extern volatile __bit                   P1POLA              __at(0x40B0);	// @ (0x816 * 8 + 0)
#define                                 P1POLA_bit          _BIT_ACCESS(PSMC1POL,0)
// PSMC1POL<P1POLB>
extern volatile __bit                   P1POLB              __at(0x40B1);	// @ (0x816 * 8 + 1)
#define                                 P1POLB_bit          _BIT_ACCESS(PSMC1POL,1)
// PSMC1POL<P1POLC>
extern volatile __bit                   P1POLC              __at(0x40B2);	// @ (0x816 * 8 + 2)
#define                                 P1POLC_bit          _BIT_ACCESS(PSMC1POL,2)
// PSMC1POL<P1POLD>
extern volatile __bit                   P1POLD              __at(0x40B3);	// @ (0x816 * 8 + 3)
#define                                 P1POLD_bit          _BIT_ACCESS(PSMC1POL,3)
// PSMC1POL<P1POLE>
extern volatile __bit                   P1POLE              __at(0x40B4);	// @ (0x816 * 8 + 4)
#define                                 P1POLE_bit          _BIT_ACCESS(PSMC1POL,4)
// PSMC1POL<P1POLF>
extern volatile __bit                   P1POLF              __at(0x40B5);	// @ (0x816 * 8 + 5)
#define                                 P1POLF_bit          _BIT_ACCESS(PSMC1POL,5)
// PSMC1SYNC<P1PRPOL>
extern volatile __bit                   P1PRPOL             __at(0x409E);	// @ (0x813 * 8 + 6)
#define                                 P1PRPOL_bit         _BIT_ACCESS(PSMC1SYNC,6)
// PSMC1PRS<P1PRSC1>
extern volatile __bit                   P1PRSC1             __at(0x40E1);	// @ (0x81C * 8 + 1)
#define                                 P1PRSC1_bit         _BIT_ACCESS(PSMC1PRS,1)
// PSMC1PRS<P1PRSC2>
extern volatile __bit                   P1PRSC2             __at(0x40E2);	// @ (0x81C * 8 + 2)
#define                                 P1PRSC2_bit         _BIT_ACCESS(PSMC1PRS,2)
// PSMC1PRS<P1PRSC3>
extern volatile __bit                   P1PRSC3             __at(0x40E3);	// @ (0x81C * 8 + 3)
#define                                 P1PRSC3_bit         _BIT_ACCESS(PSMC1PRS,3)
// PSMC1PRS<P1PRSC4>
extern volatile __bit                   P1PRSC4             __at(0x40E4);	// @ (0x81C * 8 + 4)
#define                                 P1PRSC4_bit         _BIT_ACCESS(PSMC1PRS,4)
// PSMC1PRS<P1PRSIN>
extern volatile __bit                   P1PRSIN             __at(0x40E7);	// @ (0x81C * 8 + 7)
