MikroElektronika/core_packages/PIC/XC8/def/PIC16F1786/mcu.h
#define                                 PSMC1DBR6_bit       _BIT_ACCESS(PSMC1DBR,6)
// PSMC1DBR<PSMC1DBR7>
extern volatile __bit                   PSMC1DBR7           __at(0x414F);	// @ (0x829 * 8 + 7)
#define                                 PSMC1DBR7_bit       _BIT_ACCESS(PSMC1DBR,7)
// PSMC1DCL<PSMC1DC0>
extern volatile __bit                   PSMC1DC0            __at(0x4118);	// @ (0x823 * 8 + 0)
#define                                 PSMC1DC0_bit        _BIT_ACCESS(PSMC1DCL,0)
// PSMC1DCL<PSMC1DC1>
extern volatile __bit                   PSMC1DC1            __at(0x4119);	// @ (0x823 * 8 + 1)
#define                                 PSMC1DC1_bit        _BIT_ACCESS(PSMC1DCL,1)
// PSMC1DCH<PSMC1DC10>
extern volatile __bit                   PSMC1DC10           __at(0x4122);	// @ (0x824 * 8 + 2)
#define                                 PSMC1DC10_bit       _BIT_ACCESS(PSMC1DCH,2)
// PSMC1DCH<PSMC1DC11>
extern volatile __bit                   PSMC1DC11           __at(0x4123);	// @ (0x824 * 8 + 3)
#define                                 PSMC1DC11_bit       _BIT_ACCESS(PSMC1DCH,3)
// PSMC1DCH<PSMC1DC12>
extern volatile __bit                   PSMC1DC12           __at(0x4124);	// @ (0x824 * 8 + 4)
#define                                 PSMC1DC12_bit       _BIT_ACCESS(PSMC1DCH,4)
// PSMC1DCH<PSMC1DC13>
extern volatile __bit                   PSMC1DC13           __at(0x4125);	// @ (0x824 * 8 + 5)
#define                                 PSMC1DC13_bit       _BIT_ACCESS(PSMC1DCH,5)
// PSMC1DCH<PSMC1DC14>
extern volatile __bit                   PSMC1DC14           __at(0x4126);	// @ (0x824 * 8 + 6)
#define                                 PSMC1DC14_bit       _BIT_ACCESS(PSMC1DCH,6)
// PSMC1DCH<PSMC1DC15>
extern volatile __bit                   PSMC1DC15           __at(0x4127);	// @ (0x824 * 8 + 7)
#define                                 PSMC1DC15_bit       _BIT_ACCESS(PSMC1DCH,7)
// PSMC1DCL<PSMC1DC2>
extern volatile __bit                   PSMC1DC2            __at(0x411A);	// @ (0x823 * 8 + 2)
#define                                 PSMC1DC2_bit        _BIT_ACCESS(PSMC1DCL,2)
// PSMC1DCL<PSMC1DC3>
extern volatile __bit                   PSMC1DC3            __at(0x411B);	// @ (0x823 * 8 + 3)
#define                                 PSMC1DC3_bit        _BIT_ACCESS(PSMC1DCL,3)
// PSMC1DCL<PSMC1DC4>
extern volatile __bit                   PSMC1DC4            __at(0x411C);	// @ (0x823 * 8 + 4)
#define                                 PSMC1DC4_bit        _BIT_ACCESS(PSMC1DCL,4)
// PSMC1DCL<PSMC1DC5>
extern volatile __bit                   PSMC1DC5            __at(0x411D);	// @ (0x823 * 8 + 5)
#define                                 PSMC1DC5_bit        _BIT_ACCESS(PSMC1DCL,5)
// PSMC1DCL<PSMC1DC6>
extern volatile __bit                   PSMC1DC6            __at(0x411E);	// @ (0x823 * 8 + 6)
#define                                 PSMC1DC6_bit        _BIT_ACCESS(PSMC1DCL,6)
// PSMC1DCL<PSMC1DC7>
extern volatile __bit                   PSMC1DC7            __at(0x411F);	// @ (0x823 * 8 + 7)
#define                                 PSMC1DC7_bit        _BIT_ACCESS(PSMC1DCL,7)
// PSMC1DCH<PSMC1DC8>
extern volatile __bit                   PSMC1DC8            __at(0x4120);	// @ (0x824 * 8 + 0)
#define                                 PSMC1DC8_bit        _BIT_ACCESS(PSMC1DCH,0)
// PSMC1DCH<PSMC1DC9>
extern volatile __bit                   PSMC1DC9            __at(0x4121);	// @ (0x824 * 8 + 1)
#define                                 PSMC1DC9_bit        _BIT_ACCESS(PSMC1DCH,1)
// PSMC1CON<PSMC1EN>
extern volatile __bit                   PSMC1EN             __at(0x408F);	// @ (0x811 * 8 + 7)
#define                                 PSMC1EN_bit         _BIT_ACCESS(PSMC1CON,7)
// PSMC1FFA<PSMC1FFA0>
extern volatile __bit                   PSMC1FFA0           __at(0x4168);	// @ (0x82D * 8 + 0)
#define                                 PSMC1FFA0_bit       _BIT_ACCESS(PSMC1FFA,0)
// PSMC1FFA<PSMC1FFA1>
extern volatile __bit                   PSMC1FFA1           __at(0x4169);	// @ (0x82D * 8 + 1)
#define                                 PSMC1FFA1_bit       _BIT_ACCESS(PSMC1FFA,1)
// PSMC1FFA<PSMC1FFA2>
extern volatile __bit                   PSMC1FFA2           __at(0x416A);	// @ (0x82D * 8 + 2)
#define                                 PSMC1FFA2_bit       _BIT_ACCESS(PSMC1FFA,2)
// PSMC1FFA<PSMC1FFA3>
extern volatile __bit                   PSMC1FFA3           __at(0x416B);	// @ (0x82D * 8 + 3)
#define                                 PSMC1FFA3_bit       _BIT_ACCESS(PSMC1FFA,3)
// PSMC1CON<PSMC1LD>
extern volatile __bit                   PSMC1LD             __at(0x408E);	// @ (0x811 * 8 + 6)
#define                                 PSMC1LD_bit         _BIT_ACCESS(PSMC1CON,6)
// PSMC1PHL<PSMC1PH0>
extern volatile __bit                   PSMC1PH0            __at(0x4108);	// @ (0x821 * 8 + 0)
#define                                 PSMC1PH0_bit        _BIT_ACCESS(PSMC1PHL,0)
// PSMC1PHL<PSMC1PH1>
extern volatile __bit                   PSMC1PH1            __at(0x4109);	// @ (0x821 * 8 + 1)
#define                                 PSMC1PH1_bit        _BIT_ACCESS(PSMC1PHL,1)
// PSMC1PHH<PSMC1PH10>
extern volatile __bit                   PSMC1PH10           __at(0x4112);	// @ (0x822 * 8 + 2)
#define                                 PSMC1PH10_bit       _BIT_ACCESS(PSMC1PHH,2)
// PSMC1PHH<PSMC1PH11>
extern volatile __bit                   PSMC1PH11           __at(0x4113);	// @ (0x822 * 8 + 3)
#define                                 PSMC1PH11_bit       _BIT_ACCESS(PSMC1PHH,3)
// PSMC1PHH<PSMC1PH12>
extern volatile __bit                   PSMC1PH12           __at(0x4114);	// @ (0x822 * 8 + 4)
#define                                 PSMC1PH12_bit       _BIT_ACCESS(PSMC1PHH,4)
// PSMC1PHH<PSMC1PH13>
extern volatile __bit                   PSMC1PH13           __at(0x4115);	// @ (0x822 * 8 + 5)
#define                                 PSMC1PH13_bit       _BIT_ACCESS(PSMC1PHH,5)
// PSMC1PHH<PSMC1PH14>
extern volatile __bit                   PSMC1PH14           __at(0x4116);	// @ (0x822 * 8 + 6)
#define                                 PSMC1PH14_bit       _BIT_ACCESS(PSMC1PHH,6)
// PSMC1PHH<PSMC1PH15>
extern volatile __bit                   PSMC1PH15           __at(0x4117);	// @ (0x822 * 8 + 7)
#define                                 PSMC1PH15_bit       _BIT_ACCESS(PSMC1PHH,7)
// PSMC1PHL<PSMC1PH2>
extern volatile __bit                   PSMC1PH2            __at(0x410A);	// @ (0x821 * 8 + 2)
#define                                 PSMC1PH2_bit        _BIT_ACCESS(PSMC1PHL,2)
// PSMC1PHL<PSMC1PH3>
extern volatile __bit                   PSMC1PH3            __at(0x410B);	// @ (0x821 * 8 + 3)
#define                                 PSMC1PH3_bit        _BIT_ACCESS(PSMC1PHL,3)
// PSMC1PHL<PSMC1PH4>
extern volatile __bit                   PSMC1PH4            __at(0x410C);	// @ (0x821 * 8 + 4)
#define                                 PSMC1PH4_bit        _BIT_ACCESS(PSMC1PHL,4)
// PSMC1PHL<PSMC1PH5>
extern volatile __bit                   PSMC1PH5            __at(0x410D);	// @ (0x821 * 8 + 5)
#define                                 PSMC1PH5_bit        _BIT_ACCESS(PSMC1PHL,5)
// PSMC1PHL<PSMC1PH6>
extern volatile __bit                   PSMC1PH6            __at(0x410E);	// @ (0x821 * 8 + 6)
#define                                 PSMC1PH6_bit        _BIT_ACCESS(PSMC1PHL,6)
// PSMC1PHL<PSMC1PH7>
extern volatile __bit                   PSMC1PH7            __at(0x410F);	// @ (0x821 * 8 + 7)
#define                                 PSMC1PH7_bit        _BIT_ACCESS(PSMC1PHL,7)
// PSMC1PHH<PSMC1PH8>
extern volatile __bit                   PSMC1PH8            __at(0x4110);	// @ (0x822 * 8 + 0)
#define                                 PSMC1PH8_bit        _BIT_ACCESS(PSMC1PHH,0)
// PSMC1PHH<PSMC1PH9>
extern volatile __bit                   PSMC1PH9            __at(0x4111);	// @ (0x822 * 8 + 1)
#define                                 PSMC1PH9_bit        _BIT_ACCESS(PSMC1PHH,1)
// PSMC1PRL<PSMC1PR0>
extern volatile __bit                   PSMC1PR0            __at(0x4128);	// @ (0x825 * 8 + 0)
#define                                 PSMC1PR0_bit        _BIT_ACCESS(PSMC1PRL,0)
// PSMC1PRL<PSMC1PR1>
extern volatile __bit                   PSMC1PR1            __at(0x4129);	// @ (0x825 * 8 + 1)
#define                                 PSMC1PR1_bit        _BIT_ACCESS(PSMC1PRL,1)
// PSMC1PRH<PSMC1PR10>
extern volatile __bit                   PSMC1PR10           __at(0x4132);	// @ (0x826 * 8 + 2)
#define                                 PSMC1PR10_bit       _BIT_ACCESS(PSMC1PRH,2)
// PSMC1PRH<PSMC1PR11>
extern volatile __bit                   PSMC1PR11           __at(0x4133);	// @ (0x826 * 8 + 3)
#define                                 PSMC1PR11_bit       _BIT_ACCESS(PSMC1PRH,3)
// PSMC1PRH<PSMC1PR12>
extern volatile __bit                   PSMC1PR12           __at(0x4134);	// @ (0x826 * 8 + 4)
#define                                 PSMC1PR12_bit       _BIT_ACCESS(PSMC1PRH,4)
// PSMC1PRH<PSMC1PR13>
extern volatile __bit                   PSMC1PR13           __at(0x4135);	// @ (0x826 * 8 + 5)
#define                                 PSMC1PR13_bit       _BIT_ACCESS(PSMC1PRH,5)
// PSMC1PRH<PSMC1PR14>
extern volatile __bit                   PSMC1PR14           __at(0x4136);	// @ (0x826 * 8 + 6)
#define                                 PSMC1PR14_bit       _BIT_ACCESS(PSMC1PRH,6)
// PSMC1PRH<PSMC1PR15>
extern volatile __bit                   PSMC1PR15           __at(0x4137);	// @ (0x826 * 8 + 7)
#define                                 PSMC1PR15_bit       _BIT_ACCESS(PSMC1PRH,7)
// PSMC1PRL<PSMC1PR2>
extern volatile __bit                   PSMC1PR2            __at(0x412A);	// @ (0x825 * 8 + 2)
#define                                 PSMC1PR2_bit        _BIT_ACCESS(PSMC1PRL,2)
// PSMC1PRL<PSMC1PR3>
extern volatile __bit                   PSMC1PR3            __at(0x412B);	// @ (0x825 * 8 + 3)
#define                                 PSMC1PR3_bit        _BIT_ACCESS(PSMC1PRL,3)
// PSMC1PRL<PSMC1PR4>
extern volatile __bit                   PSMC1PR4            __at(0x412C);	// @ (0x825 * 8 + 4)
#define                                 PSMC1PR4_bit        _BIT_ACCESS(PSMC1PRL,4)
// PSMC1PRL<PSMC1PR5>
extern volatile __bit                   PSMC1PR5            __at(0x412D);	// @ (0x825 * 8 + 5)
#define                                 PSMC1PR5_bit        _BIT_ACCESS(PSMC1PRL,5)
// PSMC1PRL<PSMC1PR6>
extern volatile __bit                   PSMC1PR6            __at(0x412E);	// @ (0x825 * 8 + 6)
#define                                 PSMC1PR6_bit        _BIT_ACCESS(PSMC1PRL,6)
// PSMC1PRL<PSMC1PR7>
extern volatile __bit                   PSMC1PR7            __at(0x412F);	// @ (0x825 * 8 + 7)
#define                                 PSMC1PR7_bit        _BIT_ACCESS(PSMC1PRL,7)
// PSMC1PRH<PSMC1PR8>
extern volatile __bit                   PSMC1PR8            __at(0x4130);	// @ (0x826 * 8 + 0)
#define                                 PSMC1PR8_bit        _BIT_ACCESS(PSMC1PRH,0)
// PSMC1PRH<PSMC1PR9>
extern volatile __bit                   PSMC1PR9            __at(0x4131);	// @ (0x826 * 8 + 1)
#define                                 PSMC1PR9_bit        _BIT_ACCESS(PSMC1PRH,1)
// PIE4<PSMC1SIE>
extern volatile __bit                   PSMC1SIE            __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 PSMC1SIE_bit        _BIT_ACCESS(PIE4,0)
// PIR4<PSMC1SIF>
extern volatile __bit                   PSMC1SIF            __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 PSMC1SIF_bit        _BIT_ACCESS(PIR4,0)
// PIE4<PSMC1TIE>
extern volatile __bit                   PSMC1TIE            __at(0x4A4);	// @ (0x94 * 8 + 4)
#define                                 PSMC1TIE_bit        _BIT_ACCESS(PIE4,4)
// PIR4<PSMC1TIF>
extern volatile __bit                   PSMC1TIF            __at(0xA4);	// @ (0x14 * 8 + 4)
#define                                 PSMC1TIF_bit        _BIT_ACCESS(PIR4,4)
// PSMC1TMRL<PSMC1TMR0>
extern volatile __bit                   PSMC1TMR0           __at(0x4138);	// @ (0x827 * 8 + 0)
#define                                 PSMC1TMR0_bit       _BIT_ACCESS(PSMC1TMRL,0)
// PSMC1TMRL<PSMC1TMR1>
extern volatile __bit                   PSMC1TMR1           __at(0x4139);	// @ (0x827 * 8 + 1)
#define                                 PSMC1TMR1_bit       _BIT_ACCESS(PSMC1TMRL,1)
// PSMC1TMRH<PSMC1TMR10>
extern volatile __bit                   PSMC1TMR10          __at(0x4142);	// @ (0x828 * 8 + 2)
#define                                 PSMC1TMR10_bit      _BIT_ACCESS(PSMC1TMRH,2)
// PSMC1TMRH<PSMC1TMR11>
extern volatile __bit                   PSMC1TMR11          __at(0x4143);	// @ (0x828 * 8 + 3)
#define                                 PSMC1TMR11_bit      _BIT_ACCESS(PSMC1TMRH,3)
// PSMC1TMRH<PSMC1TMR12>
extern volatile __bit                   PSMC1TMR12          __at(0x4144);	// @ (0x828 * 8 + 4)
#define                                 PSMC1TMR12_bit      _BIT_ACCESS(PSMC1TMRH,4)
// PSMC1TMRH<PSMC1TMR13>
extern volatile __bit                   PSMC1TMR13          __at(0x4145);	// @ (0x828 * 8 + 5)
#define                                 PSMC1TMR13_bit      _BIT_ACCESS(PSMC1TMRH,5)
// PSMC1TMRH<PSMC1TMR14>
extern volatile __bit                   PSMC1TMR14          __at(0x4146);	// @ (0x828 * 8 + 6)
#define                                 PSMC1TMR14_bit      _BIT_ACCESS(PSMC1TMRH,6)
// PSMC1TMRH<PSMC1TMR15>
extern volatile __bit                   PSMC1TMR15          __at(0x4147);	// @ (0x828 * 8 + 7)
#define                                 PSMC1TMR15_bit      _BIT_ACCESS(PSMC1TMRH,7)
// PSMC1TMRL<PSMC1TMR2>
extern volatile __bit                   PSMC1TMR2           __at(0x413A);	// @ (0x827 * 8 + 2)
#define                                 PSMC1TMR2_bit       _BIT_ACCESS(PSMC1TMRL,2)
// PSMC1TMRL<PSMC1TMR3>
extern volatile __bit                   PSMC1TMR3           __at(0x413B);	// @ (0x827 * 8 + 3)
#define                                 PSMC1TMR3_bit       _BIT_ACCESS(PSMC1TMRL,3)
// PSMC1TMRL<PSMC1TMR4>
extern volatile __bit                   PSMC1TMR4           __at(0x413C);	// @ (0x827 * 8 + 4)
#define                                 PSMC1TMR4_bit       _BIT_ACCESS(PSMC1TMRL,4)
// PSMC1TMRL<PSMC1TMR5>
extern volatile __bit                   PSMC1TMR5           __at(0x413D);	// @ (0x827 * 8 + 5)
#define                                 PSMC1TMR5_bit       _BIT_ACCESS(PSMC1TMRL,5)
// PSMC1TMRL<PSMC1TMR6>
extern volatile __bit                   PSMC1TMR6           __at(0x413E);	// @ (0x827 * 8 + 6)
#define                                 PSMC1TMR6_bit       _BIT_ACCESS(PSMC1TMRL,6)
// PSMC1TMRL<PSMC1TMR7>
extern volatile __bit                   PSMC1TMR7           __at(0x413F);	// @ (0x827 * 8 + 7)
#define                                 PSMC1TMR7_bit       _BIT_ACCESS(PSMC1TMRL,7)
// PSMC1TMRH<PSMC1TMR8>
extern volatile __bit                   PSMC1TMR8           __at(0x4140);	// @ (0x828 * 8 + 0)
#define                                 PSMC1TMR8_bit       _BIT_ACCESS(PSMC1TMRH,0)
// PSMC1TMRH<PSMC1TMR9>
extern volatile __bit                   PSMC1TMR9           __at(0x4141);	// @ (0x828 * 8 + 1)
#define                                 PSMC1TMR9_bit       _BIT_ACCESS(PSMC1TMRH,1)
// PSMC2BLKF<PSMC2BLKF0>
extern volatile __bit                   PSMC2BLKF0          __at(0x4260);	// @ (0x84C * 8 + 0)
#define                                 PSMC2BLKF0_bit      _BIT_ACCESS(PSMC2BLKF,0)
// PSMC2BLKF<PSMC2BLKF1>
extern volatile __bit                   PSMC2BLKF1          __at(0x4261);	// @ (0x84C * 8 + 1)
#define                                 PSMC2BLKF1_bit      _BIT_ACCESS(PSMC2BLKF,1)
// PSMC2BLKF<PSMC2BLKF2>
extern volatile __bit                   PSMC2BLKF2          __at(0x4262);	// @ (0x84C * 8 + 2)
#define                                 PSMC2BLKF2_bit      _BIT_ACCESS(PSMC2BLKF,2)
// PSMC2BLKF<PSMC2BLKF3>
extern volatile __bit                   PSMC2BLKF3          __at(0x4263);	// @ (0x84C * 8 + 3)
#define                                 PSMC2BLKF3_bit      _BIT_ACCESS(PSMC2BLKF,3)
// PSMC2BLKF<PSMC2BLKF4>
extern volatile __bit                   PSMC2BLKF4          __at(0x4264);	// @ (0x84C * 8 + 4)
#define                                 PSMC2BLKF4_bit      _BIT_ACCESS(PSMC2BLKF,4)
// PSMC2BLKF<PSMC2BLKF5>
extern volatile __bit                   PSMC2BLKF5          __at(0x4265);	// @ (0x84C * 8 + 5)
#define                                 PSMC2BLKF5_bit      _BIT_ACCESS(PSMC2BLKF,5)
// PSMC2BLKF<PSMC2BLKF6>
extern volatile __bit                   PSMC2BLKF6          __at(0x4266);	// @ (0x84C * 8 + 6)
#define                                 PSMC2BLKF6_bit      _BIT_ACCESS(PSMC2BLKF,6)
// PSMC2BLKF<PSMC2BLKF7>
extern volatile __bit                   PSMC2BLKF7          __at(0x4267);	// @ (0x84C * 8 + 7)
#define                                 PSMC2BLKF7_bit      _BIT_ACCESS(PSMC2BLKF,7)
// PSMC2BLKR<PSMC2BLKR0>
extern volatile __bit                   PSMC2BLKR0          __at(0x4258);	// @ (0x84B * 8 + 0)
#define                                 PSMC2BLKR0_bit      _BIT_ACCESS(PSMC2BLKR,0)
// PSMC2BLKR<PSMC2BLKR1>
extern volatile __bit                   PSMC2BLKR1          __at(0x4259);	// @ (0x84B * 8 + 1)
#define                                 PSMC2BLKR1_bit      _BIT_ACCESS(PSMC2BLKR,1)
// PSMC2BLKR<PSMC2BLKR2>
extern volatile __bit                   PSMC2BLKR2          __at(0x425A);	// @ (0x84B * 8 + 2)
#define                                 PSMC2BLKR2_bit      _BIT_ACCESS(PSMC2BLKR,2)
// PSMC2BLKR<PSMC2BLKR3>
extern volatile __bit                   PSMC2BLKR3          __at(0x425B);	// @ (0x84B * 8 + 3)
#define                                 PSMC2BLKR3_bit      _BIT_ACCESS(PSMC2BLKR,3)
// PSMC2BLKR<PSMC2BLKR4>
extern volatile __bit                   PSMC2BLKR4          __at(0x425C);	// @ (0x84B * 8 + 4)
#define                                 PSMC2BLKR4_bit      _BIT_ACCESS(PSMC2BLKR,4)
// PSMC2BLKR<PSMC2BLKR5>
extern volatile __bit                   PSMC2BLKR5          __at(0x425D);	// @ (0x84B * 8 + 5)
#define                                 PSMC2BLKR5_bit      _BIT_ACCESS(PSMC2BLKR,5)
// PSMC2BLKR<PSMC2BLKR6>
extern volatile __bit                   PSMC2BLKR6          __at(0x425E);	// @ (0x84B * 8 + 6)
#define                                 PSMC2BLKR6_bit      _BIT_ACCESS(PSMC2BLKR,6)
// PSMC2BLKR<PSMC2BLKR7>
extern volatile __bit                   PSMC2BLKR7          __at(0x425F);	// @ (0x84B * 8 + 7)
#define                                 PSMC2BLKR7_bit      _BIT_ACCESS(PSMC2BLKR,7)
// PSMC2DBF<PSMC2DBF0>
extern volatile __bit                   PSMC2DBF0           __at(0x4250);	// @ (0x84A * 8 + 0)
#define                                 PSMC2DBF0_bit       _BIT_ACCESS(PSMC2DBF,0)
// PSMC2DBF<PSMC2DBF1>
extern volatile __bit                   PSMC2DBF1           __at(0x4251);	// @ (0x84A * 8 + 1)
#define                                 PSMC2DBF1_bit       _BIT_ACCESS(PSMC2DBF,1)
// PSMC2DBF<PSMC2DBF2>
extern volatile __bit                   PSMC2DBF2           __at(0x4252);	// @ (0x84A * 8 + 2)
#define                                 PSMC2DBF2_bit       _BIT_ACCESS(PSMC2DBF,2)
// PSMC2DBF<PSMC2DBF3>
extern volatile __bit                   PSMC2DBF3           __at(0x4253);	// @ (0x84A * 8 + 3)
#define                                 PSMC2DBF3_bit       _BIT_ACCESS(PSMC2DBF,3)
// PSMC2DBF<PSMC2DBF4>
extern volatile __bit                   PSMC2DBF4           __at(0x4254);	// @ (0x84A * 8 + 4)
#define                                 PSMC2DBF4_bit       _BIT_ACCESS(PSMC2DBF,4)
// PSMC2DBF<PSMC2DBF5>
extern volatile __bit                   PSMC2DBF5           __at(0x4255);	// @ (0x84A * 8 + 5)
#define                                 PSMC2DBF5_bit       _BIT_ACCESS(PSMC2DBF,5)
// PSMC2DBF<PSMC2DBF6>
extern volatile __bit                   PSMC2DBF6           __at(0x4256);	// @ (0x84A * 8 + 6)
#define                                 PSMC2DBF6_bit       _BIT_ACCESS(PSMC2DBF,6)
// PSMC2DBF<PSMC2DBF7>
extern volatile __bit                   PSMC2DBF7           __at(0x4257);	// @ (0x84A * 8 + 7)
#define                                 PSMC2DBF7_bit       _BIT_ACCESS(PSMC2DBF,7)
// PSMC2DBR<PSMC2DBR0>
extern volatile __bit                   PSMC2DBR0           __at(0x4248);	// @ (0x849 * 8 + 0)
#define                                 PSMC2DBR0_bit       _BIT_ACCESS(PSMC2DBR,0)
// PSMC2DBR<PSMC2DBR1>
extern volatile __bit                   PSMC2DBR1           __at(0x4249);	// @ (0x849 * 8 + 1)
#define                                 PSMC2DBR1_bit       _BIT_ACCESS(PSMC2DBR,1)
// PSMC2DBR<PSMC2DBR2>
extern volatile __bit                   PSMC2DBR2           __at(0x424A);	// @ (0x849 * 8 + 2)
#define                                 PSMC2DBR2_bit       _BIT_ACCESS(PSMC2DBR,2)
// PSMC2DBR<PSMC2DBR3>
extern volatile __bit                   PSMC2DBR3           __at(0x424B);	// @ (0x849 * 8 + 3)
#define                                 PSMC2DBR3_bit       _BIT_ACCESS(PSMC2DBR,3)
// PSMC2DBR<PSMC2DBR4>
extern volatile __bit                   PSMC2DBR4           __at(0x424C);	// @ (0x849 * 8 + 4)
#define                                 PSMC2DBR4_bit       _BIT_ACCESS(PSMC2DBR,4)
// PSMC2DBR<PSMC2DBR5>
extern volatile __bit                   PSMC2DBR5           __at(0x424D);	// @ (0x849 * 8 + 5)
#define                                 PSMC2DBR5_bit       _BIT_ACCESS(PSMC2DBR,5)
// PSMC2DBR<PSMC2DBR6>
extern volatile __bit                   PSMC2DBR6           __at(0x424E);	// @ (0x849 * 8 + 6)
#define                                 PSMC2DBR6_bit       _BIT_ACCESS(PSMC2DBR,6)
// PSMC2DBR<PSMC2DBR7>
extern volatile __bit                   PSMC2DBR7           __at(0x424F);	// @ (0x849 * 8 + 7)
#define                                 PSMC2DBR7_bit       _BIT_ACCESS(PSMC2DBR,7)
// PSMC2DCL<PSMC2DC0>
extern volatile __bit                   PSMC2DC0            __at(0x4218);	// @ (0x843 * 8 + 0)
#define                                 PSMC2DC0_bit        _BIT_ACCESS(PSMC2DCL,0)
// PSMC2DCL<PSMC2DC1>
extern volatile __bit                   PSMC2DC1            __at(0x4219);	// @ (0x843 * 8 + 1)
#define                                 PSMC2DC1_bit        _BIT_ACCESS(PSMC2DCL,1)
// PSMC2DCH<PSMC2DC10>
extern volatile __bit                   PSMC2DC10           __at(0x4222);	// @ (0x844 * 8 + 2)
#define                                 PSMC2DC10_bit       _BIT_ACCESS(PSMC2DCH,2)
// PSMC2DCH<PSMC2DC11>
extern volatile __bit                   PSMC2DC11           __at(0x4223);	// @ (0x844 * 8 + 3)
#define                                 PSMC2DC11_bit       _BIT_ACCESS(PSMC2DCH,3)
// PSMC2DCH<PSMC2DC12>
extern volatile __bit                   PSMC2DC12           __at(0x4224);	// @ (0x844 * 8 + 4)
#define                                 PSMC2DC12_bit       _BIT_ACCESS(PSMC2DCH,4)
// PSMC2DCH<PSMC2DC13>
extern volatile __bit                   PSMC2DC13           __at(0x4225);	// @ (0x844 * 8 + 5)
#define                                 PSMC2DC13_bit       _BIT_ACCESS(PSMC2DCH,5)
// PSMC2DCH<PSMC2DC14>
extern volatile __bit                   PSMC2DC14           __at(0x4226);	// @ (0x844 * 8 + 6)
#define                                 PSMC2DC14_bit       _BIT_ACCESS(PSMC2DCH,6)
// PSMC2DCH<PSMC2DC15>
extern volatile __bit                   PSMC2DC15           __at(0x4227);	// @ (0x844 * 8 + 7)
#define                                 PSMC2DC15_bit       _BIT_ACCESS(PSMC2DCH,7)
// PSMC2DCL<PSMC2DC2>
extern volatile __bit                   PSMC2DC2            __at(0x421A);	// @ (0x843 * 8 + 2)
#define                                 PSMC2DC2_bit        _BIT_ACCESS(PSMC2DCL,2)
// PSMC2DCL<PSMC2DC3>
extern volatile __bit                   PSMC2DC3            __at(0x421B);	// @ (0x843 * 8 + 3)
#define                                 PSMC2DC3_bit        _BIT_ACCESS(PSMC2DCL,3)
// PSMC2DCL<PSMC2DC4>
extern volatile __bit                   PSMC2DC4            __at(0x421C);	// @ (0x843 * 8 + 4)
#define                                 PSMC2DC4_bit        _BIT_ACCESS(PSMC2DCL,4)
// PSMC2DCL<PSMC2DC5>
