MikroElektronika/core_packages/PIC/XC8/def/PIC16F1786/mcu.h
extern volatile __bit                   PSMC2DC5            __at(0x421D);	// @ (0x843 * 8 + 5)
#define                                 PSMC2DC5_bit        _BIT_ACCESS(PSMC2DCL,5)
// PSMC2DCL<PSMC2DC6>
extern volatile __bit                   PSMC2DC6            __at(0x421E);	// @ (0x843 * 8 + 6)
#define                                 PSMC2DC6_bit        _BIT_ACCESS(PSMC2DCL,6)
// PSMC2DCL<PSMC2DC7>
extern volatile __bit                   PSMC2DC7            __at(0x421F);	// @ (0x843 * 8 + 7)
#define                                 PSMC2DC7_bit        _BIT_ACCESS(PSMC2DCL,7)
// PSMC2DCH<PSMC2DC8>
extern volatile __bit                   PSMC2DC8            __at(0x4220);	// @ (0x844 * 8 + 0)
#define                                 PSMC2DC8_bit        _BIT_ACCESS(PSMC2DCH,0)
// PSMC2DCH<PSMC2DC9>
extern volatile __bit                   PSMC2DC9            __at(0x4221);	// @ (0x844 * 8 + 1)
#define                                 PSMC2DC9_bit        _BIT_ACCESS(PSMC2DCH,1)
// PSMC2CON<PSMC2EN>
extern volatile __bit                   PSMC2EN             __at(0x418F);	// @ (0x831 * 8 + 7)
#define                                 PSMC2EN_bit         _BIT_ACCESS(PSMC2CON,7)
// PSMC2FFA<PSMC2FFA0>
extern volatile __bit                   PSMC2FFA0           __at(0x4268);	// @ (0x84D * 8 + 0)
#define                                 PSMC2FFA0_bit       _BIT_ACCESS(PSMC2FFA,0)
// PSMC2FFA<PSMC2FFA1>
extern volatile __bit                   PSMC2FFA1           __at(0x4269);	// @ (0x84D * 8 + 1)
#define                                 PSMC2FFA1_bit       _BIT_ACCESS(PSMC2FFA,1)
// PSMC2FFA<PSMC2FFA2>
extern volatile __bit                   PSMC2FFA2           __at(0x426A);	// @ (0x84D * 8 + 2)
#define                                 PSMC2FFA2_bit       _BIT_ACCESS(PSMC2FFA,2)
// PSMC2FFA<PSMC2FFA3>
extern volatile __bit                   PSMC2FFA3           __at(0x426B);	// @ (0x84D * 8 + 3)
#define                                 PSMC2FFA3_bit       _BIT_ACCESS(PSMC2FFA,3)
// PSMC2CON<PSMC2LD>
extern volatile __bit                   PSMC2LD             __at(0x418E);	// @ (0x831 * 8 + 6)
#define                                 PSMC2LD_bit         _BIT_ACCESS(PSMC2CON,6)
// PSMC2PHL<PSMC2PH0>
extern volatile __bit                   PSMC2PH0            __at(0x4208);	// @ (0x841 * 8 + 0)
#define                                 PSMC2PH0_bit        _BIT_ACCESS(PSMC2PHL,0)
// PSMC2PHL<PSMC2PH1>
extern volatile __bit                   PSMC2PH1            __at(0x4209);	// @ (0x841 * 8 + 1)
#define                                 PSMC2PH1_bit        _BIT_ACCESS(PSMC2PHL,1)
// PSMC2PHH<PSMC2PH10>
extern volatile __bit                   PSMC2PH10           __at(0x4212);	// @ (0x842 * 8 + 2)
#define                                 PSMC2PH10_bit       _BIT_ACCESS(PSMC2PHH,2)
// PSMC2PHH<PSMC2PH11>
extern volatile __bit                   PSMC2PH11           __at(0x4213);	// @ (0x842 * 8 + 3)
#define                                 PSMC2PH11_bit       _BIT_ACCESS(PSMC2PHH,3)
// PSMC2PHH<PSMC2PH12>
extern volatile __bit                   PSMC2PH12           __at(0x4214);	// @ (0x842 * 8 + 4)
#define                                 PSMC2PH12_bit       _BIT_ACCESS(PSMC2PHH,4)
// PSMC2PHH<PSMC2PH13>
extern volatile __bit                   PSMC2PH13           __at(0x4215);	// @ (0x842 * 8 + 5)
#define                                 PSMC2PH13_bit       _BIT_ACCESS(PSMC2PHH,5)
// PSMC2PHH<PSMC2PH14>
extern volatile __bit                   PSMC2PH14           __at(0x4216);	// @ (0x842 * 8 + 6)
#define                                 PSMC2PH14_bit       _BIT_ACCESS(PSMC2PHH,6)
// PSMC2PHH<PSMC2PH15>
extern volatile __bit                   PSMC2PH15           __at(0x4217);	// @ (0x842 * 8 + 7)
#define                                 PSMC2PH15_bit       _BIT_ACCESS(PSMC2PHH,7)
// PSMC2PHL<PSMC2PH2>
extern volatile __bit                   PSMC2PH2            __at(0x420A);	// @ (0x841 * 8 + 2)
#define                                 PSMC2PH2_bit        _BIT_ACCESS(PSMC2PHL,2)
// PSMC2PHL<PSMC2PH3>
extern volatile __bit                   PSMC2PH3            __at(0x420B);	// @ (0x841 * 8 + 3)
#define                                 PSMC2PH3_bit        _BIT_ACCESS(PSMC2PHL,3)
// PSMC2PHL<PSMC2PH4>
extern volatile __bit                   PSMC2PH4            __at(0x420C);	// @ (0x841 * 8 + 4)
#define                                 PSMC2PH4_bit        _BIT_ACCESS(PSMC2PHL,4)
// PSMC2PHL<PSMC2PH5>
extern volatile __bit                   PSMC2PH5            __at(0x420D);	// @ (0x841 * 8 + 5)
#define                                 PSMC2PH5_bit        _BIT_ACCESS(PSMC2PHL,5)
// PSMC2PHL<PSMC2PH6>
extern volatile __bit                   PSMC2PH6            __at(0x420E);	// @ (0x841 * 8 + 6)
#define                                 PSMC2PH6_bit        _BIT_ACCESS(PSMC2PHL,6)
// PSMC2PHL<PSMC2PH7>
extern volatile __bit                   PSMC2PH7            __at(0x420F);	// @ (0x841 * 8 + 7)
#define                                 PSMC2PH7_bit        _BIT_ACCESS(PSMC2PHL,7)
// PSMC2PHH<PSMC2PH8>
extern volatile __bit                   PSMC2PH8            __at(0x4210);	// @ (0x842 * 8 + 0)
#define                                 PSMC2PH8_bit        _BIT_ACCESS(PSMC2PHH,0)
// PSMC2PHH<PSMC2PH9>
extern volatile __bit                   PSMC2PH9            __at(0x4211);	// @ (0x842 * 8 + 1)
#define                                 PSMC2PH9_bit        _BIT_ACCESS(PSMC2PHH,1)
// PSMC2PRL<PSMC2PR0>
extern volatile __bit                   PSMC2PR0            __at(0x4228);	// @ (0x845 * 8 + 0)
#define                                 PSMC2PR0_bit        _BIT_ACCESS(PSMC2PRL,0)
// PSMC2PRL<PSMC2PR1>
extern volatile __bit                   PSMC2PR1            __at(0x4229);	// @ (0x845 * 8 + 1)
#define                                 PSMC2PR1_bit        _BIT_ACCESS(PSMC2PRL,1)
// PSMC2PRH<PSMC2PR10>
extern volatile __bit                   PSMC2PR10           __at(0x4232);	// @ (0x846 * 8 + 2)
#define                                 PSMC2PR10_bit       _BIT_ACCESS(PSMC2PRH,2)
// PSMC2PRH<PSMC2PR11>
extern volatile __bit                   PSMC2PR11           __at(0x4233);	// @ (0x846 * 8 + 3)
#define                                 PSMC2PR11_bit       _BIT_ACCESS(PSMC2PRH,3)
// PSMC2PRH<PSMC2PR12>
extern volatile __bit                   PSMC2PR12           __at(0x4234);	// @ (0x846 * 8 + 4)
#define                                 PSMC2PR12_bit       _BIT_ACCESS(PSMC2PRH,4)
// PSMC2PRH<PSMC2PR13>
extern volatile __bit                   PSMC2PR13           __at(0x4235);	// @ (0x846 * 8 + 5)
#define                                 PSMC2PR13_bit       _BIT_ACCESS(PSMC2PRH,5)
// PSMC2PRH<PSMC2PR14>
extern volatile __bit                   PSMC2PR14           __at(0x4236);	// @ (0x846 * 8 + 6)
#define                                 PSMC2PR14_bit       _BIT_ACCESS(PSMC2PRH,6)
// PSMC2PRH<PSMC2PR15>
extern volatile __bit                   PSMC2PR15           __at(0x4237);	// @ (0x846 * 8 + 7)
#define                                 PSMC2PR15_bit       _BIT_ACCESS(PSMC2PRH,7)
// PSMC2PRL<PSMC2PR2>
extern volatile __bit                   PSMC2PR2            __at(0x422A);	// @ (0x845 * 8 + 2)
#define                                 PSMC2PR2_bit        _BIT_ACCESS(PSMC2PRL,2)
// PSMC2PRL<PSMC2PR3>
extern volatile __bit                   PSMC2PR3            __at(0x422B);	// @ (0x845 * 8 + 3)
#define                                 PSMC2PR3_bit        _BIT_ACCESS(PSMC2PRL,3)
// PSMC2PRL<PSMC2PR4>
extern volatile __bit                   PSMC2PR4            __at(0x422C);	// @ (0x845 * 8 + 4)
#define                                 PSMC2PR4_bit        _BIT_ACCESS(PSMC2PRL,4)
// PSMC2PRL<PSMC2PR5>
extern volatile __bit                   PSMC2PR5            __at(0x422D);	// @ (0x845 * 8 + 5)
#define                                 PSMC2PR5_bit        _BIT_ACCESS(PSMC2PRL,5)
// PSMC2PRL<PSMC2PR6>
extern volatile __bit                   PSMC2PR6            __at(0x422E);	// @ (0x845 * 8 + 6)
#define                                 PSMC2PR6_bit        _BIT_ACCESS(PSMC2PRL,6)
// PSMC2PRL<PSMC2PR7>
extern volatile __bit                   PSMC2PR7            __at(0x422F);	// @ (0x845 * 8 + 7)
#define                                 PSMC2PR7_bit        _BIT_ACCESS(PSMC2PRL,7)
// PSMC2PRH<PSMC2PR8>
extern volatile __bit                   PSMC2PR8            __at(0x4230);	// @ (0x846 * 8 + 0)
#define                                 PSMC2PR8_bit        _BIT_ACCESS(PSMC2PRH,0)
// PSMC2PRH<PSMC2PR9>
extern volatile __bit                   PSMC2PR9            __at(0x4231);	// @ (0x846 * 8 + 1)
#define                                 PSMC2PR9_bit        _BIT_ACCESS(PSMC2PRH,1)
// PIE4<PSMC2SIE>
extern volatile __bit                   PSMC2SIE            __at(0x4A1);	// @ (0x94 * 8 + 1)
#define                                 PSMC2SIE_bit        _BIT_ACCESS(PIE4,1)
// PIR4<PSMC2SIF>
extern volatile __bit                   PSMC2SIF            __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 PSMC2SIF_bit        _BIT_ACCESS(PIR4,1)
// PIE4<PSMC2TIE>
extern volatile __bit                   PSMC2TIE            __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 PSMC2TIE_bit        _BIT_ACCESS(PIE4,5)
// PIR4<PSMC2TIF>
extern volatile __bit                   PSMC2TIF            __at(0xA5);	// @ (0x14 * 8 + 5)
#define                                 PSMC2TIF_bit        _BIT_ACCESS(PIR4,5)
// PSMC2TMRL<PSMC2TMR0>
extern volatile __bit                   PSMC2TMR0           __at(0x4238);	// @ (0x847 * 8 + 0)
#define                                 PSMC2TMR0_bit       _BIT_ACCESS(PSMC2TMRL,0)
// PSMC2TMRL<PSMC2TMR1>
extern volatile __bit                   PSMC2TMR1           __at(0x4239);	// @ (0x847 * 8 + 1)
#define                                 PSMC2TMR1_bit       _BIT_ACCESS(PSMC2TMRL,1)
// PSMC2TMRH<PSMC2TMR10>
extern volatile __bit                   PSMC2TMR10          __at(0x4242);	// @ (0x848 * 8 + 2)
#define                                 PSMC2TMR10_bit      _BIT_ACCESS(PSMC2TMRH,2)
// PSMC2TMRH<PSMC2TMR11>
extern volatile __bit                   PSMC2TMR11          __at(0x4243);	// @ (0x848 * 8 + 3)
#define                                 PSMC2TMR11_bit      _BIT_ACCESS(PSMC2TMRH,3)
// PSMC2TMRH<PSMC2TMR12>
extern volatile __bit                   PSMC2TMR12          __at(0x4244);	// @ (0x848 * 8 + 4)
#define                                 PSMC2TMR12_bit      _BIT_ACCESS(PSMC2TMRH,4)
// PSMC2TMRH<PSMC2TMR13>
extern volatile __bit                   PSMC2TMR13          __at(0x4245);	// @ (0x848 * 8 + 5)
#define                                 PSMC2TMR13_bit      _BIT_ACCESS(PSMC2TMRH,5)
// PSMC2TMRH<PSMC2TMR14>
extern volatile __bit                   PSMC2TMR14          __at(0x4246);	// @ (0x848 * 8 + 6)
#define                                 PSMC2TMR14_bit      _BIT_ACCESS(PSMC2TMRH,6)
// PSMC2TMRH<PSMC2TMR15>
extern volatile __bit                   PSMC2TMR15          __at(0x4247);	// @ (0x848 * 8 + 7)
#define                                 PSMC2TMR15_bit      _BIT_ACCESS(PSMC2TMRH,7)
// PSMC2TMRL<PSMC2TMR2>
extern volatile __bit                   PSMC2TMR2           __at(0x423A);	// @ (0x847 * 8 + 2)
#define                                 PSMC2TMR2_bit       _BIT_ACCESS(PSMC2TMRL,2)
// PSMC2TMRL<PSMC2TMR3>
extern volatile __bit                   PSMC2TMR3           __at(0x423B);	// @ (0x847 * 8 + 3)
#define                                 PSMC2TMR3_bit       _BIT_ACCESS(PSMC2TMRL,3)
// PSMC2TMRL<PSMC2TMR4>
extern volatile __bit                   PSMC2TMR4           __at(0x423C);	// @ (0x847 * 8 + 4)
#define                                 PSMC2TMR4_bit       _BIT_ACCESS(PSMC2TMRL,4)
// PSMC2TMRL<PSMC2TMR5>
extern volatile __bit                   PSMC2TMR5           __at(0x423D);	// @ (0x847 * 8 + 5)
#define                                 PSMC2TMR5_bit       _BIT_ACCESS(PSMC2TMRL,5)
// PSMC2TMRL<PSMC2TMR6>
extern volatile __bit                   PSMC2TMR6           __at(0x423E);	// @ (0x847 * 8 + 6)
#define                                 PSMC2TMR6_bit       _BIT_ACCESS(PSMC2TMRL,6)
// PSMC2TMRL<PSMC2TMR7>
extern volatile __bit                   PSMC2TMR7           __at(0x423F);	// @ (0x847 * 8 + 7)
#define                                 PSMC2TMR7_bit       _BIT_ACCESS(PSMC2TMRL,7)
// PSMC2TMRH<PSMC2TMR8>
extern volatile __bit                   PSMC2TMR8           __at(0x4240);	// @ (0x848 * 8 + 0)
#define                                 PSMC2TMR8_bit       _BIT_ACCESS(PSMC2TMRH,0)
// PSMC2TMRH<PSMC2TMR9>
extern volatile __bit                   PSMC2TMR9           __at(0x4241);	// @ (0x848 * 8 + 1)
#define                                 PSMC2TMR9_bit       _BIT_ACCESS(PSMC2TMRH,1)
// PSMC3BLKF<PSMC3BLKF0>
extern volatile __bit                   PSMC3BLKF0          __at(0x4360);	// @ (0x86C * 8 + 0)
#define                                 PSMC3BLKF0_bit      _BIT_ACCESS(PSMC3BLKF,0)
// PSMC3BLKF<PSMC3BLKF1>
extern volatile __bit                   PSMC3BLKF1          __at(0x4361);	// @ (0x86C * 8 + 1)
#define                                 PSMC3BLKF1_bit      _BIT_ACCESS(PSMC3BLKF,1)
// PSMC3BLKF<PSMC3BLKF2>
extern volatile __bit                   PSMC3BLKF2          __at(0x4362);	// @ (0x86C * 8 + 2)
#define                                 PSMC3BLKF2_bit      _BIT_ACCESS(PSMC3BLKF,2)
// PSMC3BLKF<PSMC3BLKF3>
extern volatile __bit                   PSMC3BLKF3          __at(0x4363);	// @ (0x86C * 8 + 3)
#define                                 PSMC3BLKF3_bit      _BIT_ACCESS(PSMC3BLKF,3)
// PSMC3BLKF<PSMC3BLKF4>
extern volatile __bit                   PSMC3BLKF4          __at(0x4364);	// @ (0x86C * 8 + 4)
#define                                 PSMC3BLKF4_bit      _BIT_ACCESS(PSMC3BLKF,4)
// PSMC3BLKF<PSMC3BLKF5>
extern volatile __bit                   PSMC3BLKF5          __at(0x4365);	// @ (0x86C * 8 + 5)
#define                                 PSMC3BLKF5_bit      _BIT_ACCESS(PSMC3BLKF,5)
// PSMC3BLKF<PSMC3BLKF6>
extern volatile __bit                   PSMC3BLKF6          __at(0x4366);	// @ (0x86C * 8 + 6)
#define                                 PSMC3BLKF6_bit      _BIT_ACCESS(PSMC3BLKF,6)
// PSMC3BLKF<PSMC3BLKF7>
extern volatile __bit                   PSMC3BLKF7          __at(0x4367);	// @ (0x86C * 8 + 7)
#define                                 PSMC3BLKF7_bit      _BIT_ACCESS(PSMC3BLKF,7)
// PSMC3BLKR<PSMC3BLKR0>
extern volatile __bit                   PSMC3BLKR0          __at(0x4358);	// @ (0x86B * 8 + 0)
#define                                 PSMC3BLKR0_bit      _BIT_ACCESS(PSMC3BLKR,0)
// PSMC3BLKR<PSMC3BLKR1>
extern volatile __bit                   PSMC3BLKR1          __at(0x4359);	// @ (0x86B * 8 + 1)
#define                                 PSMC3BLKR1_bit      _BIT_ACCESS(PSMC3BLKR,1)
// PSMC3BLKR<PSMC3BLKR2>
extern volatile __bit                   PSMC3BLKR2          __at(0x435A);	// @ (0x86B * 8 + 2)
#define                                 PSMC3BLKR2_bit      _BIT_ACCESS(PSMC3BLKR,2)
// PSMC3BLKR<PSMC3BLKR3>
extern volatile __bit                   PSMC3BLKR3          __at(0x435B);	// @ (0x86B * 8 + 3)
#define                                 PSMC3BLKR3_bit      _BIT_ACCESS(PSMC3BLKR,3)
// PSMC3BLKR<PSMC3BLKR4>
extern volatile __bit                   PSMC3BLKR4          __at(0x435C);	// @ (0x86B * 8 + 4)
#define                                 PSMC3BLKR4_bit      _BIT_ACCESS(PSMC3BLKR,4)
// PSMC3BLKR<PSMC3BLKR5>
extern volatile __bit                   PSMC3BLKR5          __at(0x435D);	// @ (0x86B * 8 + 5)
#define                                 PSMC3BLKR5_bit      _BIT_ACCESS(PSMC3BLKR,5)
// PSMC3BLKR<PSMC3BLKR6>
extern volatile __bit                   PSMC3BLKR6          __at(0x435E);	// @ (0x86B * 8 + 6)
#define                                 PSMC3BLKR6_bit      _BIT_ACCESS(PSMC3BLKR,6)
// PSMC3BLKR<PSMC3BLKR7>
extern volatile __bit                   PSMC3BLKR7          __at(0x435F);	// @ (0x86B * 8 + 7)
#define                                 PSMC3BLKR7_bit      _BIT_ACCESS(PSMC3BLKR,7)
// PSMC3DBF<PSMC3DBF0>
extern volatile __bit                   PSMC3DBF0           __at(0x4350);	// @ (0x86A * 8 + 0)
#define                                 PSMC3DBF0_bit       _BIT_ACCESS(PSMC3DBF,0)
// PSMC3DBF<PSMC3DBF1>
extern volatile __bit                   PSMC3DBF1           __at(0x4351);	// @ (0x86A * 8 + 1)
#define                                 PSMC3DBF1_bit       _BIT_ACCESS(PSMC3DBF,1)
// PSMC3DBF<PSMC3DBF2>
extern volatile __bit                   PSMC3DBF2           __at(0x4352);	// @ (0x86A * 8 + 2)
#define                                 PSMC3DBF2_bit       _BIT_ACCESS(PSMC3DBF,2)
// PSMC3DBF<PSMC3DBF3>
extern volatile __bit                   PSMC3DBF3           __at(0x4353);	// @ (0x86A * 8 + 3)
#define                                 PSMC3DBF3_bit       _BIT_ACCESS(PSMC3DBF,3)
// PSMC3DBF<PSMC3DBF4>
extern volatile __bit                   PSMC3DBF4           __at(0x4354);	// @ (0x86A * 8 + 4)
#define                                 PSMC3DBF4_bit       _BIT_ACCESS(PSMC3DBF,4)
// PSMC3DBF<PSMC3DBF5>
extern volatile __bit                   PSMC3DBF5           __at(0x4355);	// @ (0x86A * 8 + 5)
#define                                 PSMC3DBF5_bit       _BIT_ACCESS(PSMC3DBF,5)
// PSMC3DBF<PSMC3DBF6>
extern volatile __bit                   PSMC3DBF6           __at(0x4356);	// @ (0x86A * 8 + 6)
#define                                 PSMC3DBF6_bit       _BIT_ACCESS(PSMC3DBF,6)
// PSMC3DBF<PSMC3DBF7>
extern volatile __bit                   PSMC3DBF7           __at(0x4357);	// @ (0x86A * 8 + 7)
#define                                 PSMC3DBF7_bit       _BIT_ACCESS(PSMC3DBF,7)
// PSMC3DBR<PSMC3DBR0>
extern volatile __bit                   PSMC3DBR0           __at(0x4348);	// @ (0x869 * 8 + 0)
#define                                 PSMC3DBR0_bit       _BIT_ACCESS(PSMC3DBR,0)
// PSMC3DBR<PSMC3DBR1>
extern volatile __bit                   PSMC3DBR1           __at(0x4349);	// @ (0x869 * 8 + 1)
#define                                 PSMC3DBR1_bit       _BIT_ACCESS(PSMC3DBR,1)
// PSMC3DBR<PSMC3DBR2>
extern volatile __bit                   PSMC3DBR2           __at(0x434A);	// @ (0x869 * 8 + 2)
#define                                 PSMC3DBR2_bit       _BIT_ACCESS(PSMC3DBR,2)
// PSMC3DBR<PSMC3DBR3>
extern volatile __bit                   PSMC3DBR3           __at(0x434B);	// @ (0x869 * 8 + 3)
#define                                 PSMC3DBR3_bit       _BIT_ACCESS(PSMC3DBR,3)
// PSMC3DBR<PSMC3DBR4>
extern volatile __bit                   PSMC3DBR4           __at(0x434C);	// @ (0x869 * 8 + 4)
#define                                 PSMC3DBR4_bit       _BIT_ACCESS(PSMC3DBR,4)
// PSMC3DBR<PSMC3DBR5>
extern volatile __bit                   PSMC3DBR5           __at(0x434D);	// @ (0x869 * 8 + 5)
#define                                 PSMC3DBR5_bit       _BIT_ACCESS(PSMC3DBR,5)
// PSMC3DBR<PSMC3DBR6>
extern volatile __bit                   PSMC3DBR6           __at(0x434E);	// @ (0x869 * 8 + 6)
#define                                 PSMC3DBR6_bit       _BIT_ACCESS(PSMC3DBR,6)
// PSMC3DBR<PSMC3DBR7>
extern volatile __bit                   PSMC3DBR7           __at(0x434F);	// @ (0x869 * 8 + 7)
#define                                 PSMC3DBR7_bit       _BIT_ACCESS(PSMC3DBR,7)
// PSMC3DCL<PSMC3DC0>
extern volatile __bit                   PSMC3DC0            __at(0x4318);	// @ (0x863 * 8 + 0)
#define                                 PSMC3DC0_bit        _BIT_ACCESS(PSMC3DCL,0)
// PSMC3DCL<PSMC3DC1>
extern volatile __bit                   PSMC3DC1            __at(0x4319);	// @ (0x863 * 8 + 1)
#define                                 PSMC3DC1_bit        _BIT_ACCESS(PSMC3DCL,1)
// PSMC3DCH<PSMC3DC10>
extern volatile __bit                   PSMC3DC10           __at(0x4322);	// @ (0x864 * 8 + 2)
#define                                 PSMC3DC10_bit       _BIT_ACCESS(PSMC3DCH,2)
// PSMC3DCH<PSMC3DC11>
extern volatile __bit                   PSMC3DC11           __at(0x4323);	// @ (0x864 * 8 + 3)
#define                                 PSMC3DC11_bit       _BIT_ACCESS(PSMC3DCH,3)
// PSMC3DCH<PSMC3DC12>
extern volatile __bit                   PSMC3DC12           __at(0x4324);	// @ (0x864 * 8 + 4)
#define                                 PSMC3DC12_bit       _BIT_ACCESS(PSMC3DCH,4)
// PSMC3DCH<PSMC3DC13>
extern volatile __bit                   PSMC3DC13           __at(0x4325);	// @ (0x864 * 8 + 5)
#define                                 PSMC3DC13_bit       _BIT_ACCESS(PSMC3DCH,5)
// PSMC3DCH<PSMC3DC14>
extern volatile __bit                   PSMC3DC14           __at(0x4326);	// @ (0x864 * 8 + 6)
#define                                 PSMC3DC14_bit       _BIT_ACCESS(PSMC3DCH,6)
// PSMC3DCH<PSMC3DC15>
extern volatile __bit                   PSMC3DC15           __at(0x4327);	// @ (0x864 * 8 + 7)
#define                                 PSMC3DC15_bit       _BIT_ACCESS(PSMC3DCH,7)
// PSMC3DCL<PSMC3DC2>
extern volatile __bit                   PSMC3DC2            __at(0x431A);	// @ (0x863 * 8 + 2)
#define                                 PSMC3DC2_bit        _BIT_ACCESS(PSMC3DCL,2)
// PSMC3DCL<PSMC3DC3>
extern volatile __bit                   PSMC3DC3            __at(0x431B);	// @ (0x863 * 8 + 3)
#define                                 PSMC3DC3_bit        _BIT_ACCESS(PSMC3DCL,3)
// PSMC3DCL<PSMC3DC4>
extern volatile __bit                   PSMC3DC4            __at(0x431C);	// @ (0x863 * 8 + 4)
#define                                 PSMC3DC4_bit        _BIT_ACCESS(PSMC3DCL,4)
// PSMC3DCL<PSMC3DC5>
extern volatile __bit                   PSMC3DC5            __at(0x431D);	// @ (0x863 * 8 + 5)
#define                                 PSMC3DC5_bit        _BIT_ACCESS(PSMC3DCL,5)
// PSMC3DCL<PSMC3DC6>
extern volatile __bit                   PSMC3DC6            __at(0x431E);	// @ (0x863 * 8 + 6)
#define                                 PSMC3DC6_bit        _BIT_ACCESS(PSMC3DCL,6)
// PSMC3DCL<PSMC3DC7>
extern volatile __bit                   PSMC3DC7            __at(0x431F);	// @ (0x863 * 8 + 7)
#define                                 PSMC3DC7_bit        _BIT_ACCESS(PSMC3DCL,7)
// PSMC3DCH<PSMC3DC8>
extern volatile __bit                   PSMC3DC8            __at(0x4320);	// @ (0x864 * 8 + 0)
#define                                 PSMC3DC8_bit        _BIT_ACCESS(PSMC3DCH,0)
// PSMC3DCH<PSMC3DC9>
extern volatile __bit                   PSMC3DC9            __at(0x4321);	// @ (0x864 * 8 + 1)
#define                                 PSMC3DC9_bit        _BIT_ACCESS(PSMC3DCH,1)
// PSMC3CON<PSMC3EN>
extern volatile __bit                   PSMC3EN             __at(0x428F);	// @ (0x851 * 8 + 7)
#define                                 PSMC3EN_bit         _BIT_ACCESS(PSMC3CON,7)
// PSMC3FFA<PSMC3FFA0>
extern volatile __bit                   PSMC3FFA0           __at(0x4368);	// @ (0x86D * 8 + 0)
#define                                 PSMC3FFA0_bit       _BIT_ACCESS(PSMC3FFA,0)
// PSMC3FFA<PSMC3FFA1>
extern volatile __bit                   PSMC3FFA1           __at(0x4369);	// @ (0x86D * 8 + 1)
#define                                 PSMC3FFA1_bit       _BIT_ACCESS(PSMC3FFA,1)
// PSMC3FFA<PSMC3FFA2>
extern volatile __bit                   PSMC3FFA2           __at(0x436A);	// @ (0x86D * 8 + 2)
#define                                 PSMC3FFA2_bit       _BIT_ACCESS(PSMC3FFA,2)
// PSMC3FFA<PSMC3FFA3>
extern volatile __bit                   PSMC3FFA3           __at(0x436B);	// @ (0x86D * 8 + 3)
#define                                 PSMC3FFA3_bit       _BIT_ACCESS(PSMC3FFA,3)
// PSMC3CON<PSMC3LD>
extern volatile __bit                   PSMC3LD             __at(0x428E);	// @ (0x851 * 8 + 6)
#define                                 PSMC3LD_bit         _BIT_ACCESS(PSMC3CON,6)
// PSMC3PHL<PSMC3PH0>
extern volatile __bit                   PSMC3PH0            __at(0x4308);	// @ (0x861 * 8 + 0)
#define                                 PSMC3PH0_bit        _BIT_ACCESS(PSMC3PHL,0)
// PSMC3PHL<PSMC3PH1>
extern volatile __bit                   PSMC3PH1            __at(0x4309);	// @ (0x861 * 8 + 1)
